export const intro = [
    'כ־15% ממערכות היחסים מידרדרות לסוג מסוים של אלימות. זה אומר שיותר מאחד מכל שמונה\n' +
        'קשרים שסביבנו עלול להיות קשר אלים, ושרבות ורבים ממי שמסביבנו היו, גם אם לזמן קצר, בקשר\n' +
        'שהיו לו סממנים אלימים. האלימות הזו יכולה להגיע בכל שכבות החברה, בכל מערכות היחסים וכלפי כל\n' +
        'אחד.',
    'האנשים הפוגעים יכולים להיות מי ש"הכי לא נראים", ממשפחות טובות, עבודה טובה, מוצלחים ונעימים.\n' +
        'זה לא אשמתך שנכנסת לתוך קשר כזה. הקשר הזה הוא לא משהו שהבאת על עצמך או שגרמת או\n' +
        'ש"הזמנת" בשום צורה שהיא.',
    'למרות שאין דרכים מובהקות לזהות בוודאות יהיה אלים בתוך זוגיות, יש מספר דפוסי התנהגות\n' +
        'שחוזרים על עצמם ויכולים להדליק נורה אדומה.',
    'חשוב לומר- גם אם אין לך "נורות אדומות", גם יש רק תחושה של איום בלי שמשהו ממש קרה, גם אם\n' +
        'אין דרך להציב במילים מדויקות את התחושה- עצם ההרגשה "בבטן" מספיק משמעותית ומספיק\n' +
        'חשובה. לא צריך להביא הוכחות והצדקות כדי לעזוב קשר אלים.'
];

export const how =
    'קודם כל, לדבר ולספר. לחברים, למשפחה, למוקדי סיוע, לכל מקום שאפשר.\n' +
    'במקרים שבהם הקשר אלים או שיש חשש לפגיעה בזמן הפרידה כדאי להתייעץ לפני עם גורמים\n' +
    'מקצועיים.\n' +
    'חשוב לזכור: אם יש פחד, אין חובה "לסיים את זה יפה". מותר פשוט לקום וללכת, מותר לברוח בלי\n' +
    'שיחת סיכום, מותר להעלם.';

export const charactersOfRelationship = [
    {
        title: 'אלימות',
        text:
            'כל סוג של אלימות וחוסר כבוד לגופך, לנפשך ולרגשותייך. האלימות יכולה להיות\n' +
            'פיזית, מינית, נפשית, כלכלית, דתית או טכנולוגית.'
    },
    {
        title: 'איומים כלפייך',
        text:
            'האיומים יכולים להיות לא רק סביב פגיעה בך, אלא גם בפגיעה בקרובים,\n' +
            'בחיות, בחפצים חשובים, וגם איומים בהתאבדות ופגיעה עצמית "בגללך" הם חלק מסימנים\n' +
            'לקשר אלים.'
    },
    {
        title: 'תחושות חוזרות של השפלה ורמיסה',
        text:
            'מול חברים או במרחב פרטי. תחושה של השפלה, לעג\n' +
            'מתמשך או זלזול קבוע ברצונות, בשאיפות, בחלומות לעתיד.'
    },
    {
        title: 'הגבלות מתמשכות',
        text: 'על לבוש, בחירת לימודים, בחירת עבודה, מפגשים חברתיים.'
    },
    {
        title: 'בידוד',
        text:
            'ניתוק ממעגלים חברתיים, ניתוק מהמשפחה, איסור על יצירת קשרים חברתיים.'
    },
    {
        title: 'דרישה לזמינות מיידית ומעקב',
        text: 'לגבי מיקום, בין אם דרך שיחות או תוכנות מעקב.'
    },
    {
        title: 'תחושה של אובססיביות והגזמה',
        text:
            'הכל הכי "גדול" כל הזמן. זו האהבה הכי גדולה, זה הקשר הכי\n' +
            'חזק, פגישות יומיומיות, טלפונים אינסופיים, מצד שני כל ריב הוא אסון, כל ערעור הוא מהותי.\n' +
            'הכל מרגיש מוגזם.'
    },
    {
        title: 'שמירת סודות',
        text:
            'תחושה שצריך להסתיר מה שקורה בקשר, שאי אפשר לחלוק עם חברים,\n' +
            'חוויות של בושה או המצאת תירוצים.'
    }
];

export const violenceType = [
    {
        title: 'פיזית',
        text: 'הרמת יד, דחיפה, לפיתה, ריתוק וכל דבר אחר שגורם כאב גופני.'
    },
    {
        title: 'מינית',
        text:
            'כפיית יחסי מין או מגע מיני, חוסר התחשבות ברצונות בתוך מסגרת יחסי מין, השפלה\n' +
            'וביוש סביב מיניות. אלימות מינית עשויה להיות קשורה גם לנושאי הריון ופריון ומחלות מין, למשל,\n' +
            'הסרה של קונדום במהלך יחסי מין ללא הסכמת הצד השני או איסור על שימוש באמצעי מניעה לתכנון\n' +
            'המשפחה.'
    },
    {
        title: 'כלכלית',
        text:
            'יצירת תלות כלכלית, הסתרה של מקורות הכנסה, הקצבת סכום קטן ללא קשר\n' +
            'לתקציב הזוגי ולהכנסה המשותפת, הטלת סנקציות כלכליות כעונש, הבדל קיצוני באיכות החיים של שני\n' +
            'בני הזוג.'
    },
    {
        title: 'רגשית',
        text:
            'אלימות רגשית היא שם גג לכל סוגי האלימות שלא כוללים פגיעה גופנית או כלכלית.'
    },
    {
        title: 'מילולית',
        text:
            'השפלות, קללות, "ניפוח" חיכוכים וטעויות קטנות לכדי ריבי ענק באופן\n' +
            'מתמשך. גם "טיפולי שתיקה" והתעלמויות לאורך זמן יכולות להחשב לאלימות מילולית.'
    },
    {
        title: 'טכנולוגית',
        text:
            'התקנת תוכנות מעקב על המכשיר ללא ידיעה ואישור, חיטוט בטלפון\n' +
            'ובמחשב, שליחת הודעות מהטלפון לחברים ובני משפחה ללא ידיעה ואישור, סחיטה או איומים\n' +
            'סביב מידע טכנולוגי אישי, השתלת מכשירי האזנה בבית, ברכב או בסביבת העבודה, שימוש\n' +
            'בתוכנות "בית חכם" על ידי לגרום לסבל וקושי מתמשך.'
    },
    {
        title: 'רוחנית',
        text:
            'נפוצה בעיקר בקשרים שבהם בני הזוג אנשים מאמינים. האלימות הרוחנית\n' +
            'כוללת למשל איסור על קיום מצוות או שבירה שלהן (למשל, מגע פיזי בזמן שהאישה נידה) או\n' +
            'שימוש בדת ובמצוות כפלטפורמה לפגיעה רגשית.'
    },
    {
        title: 'מיניפולציות, שקרים ונרנור (gaslighting)',
        text:
            'הכחשות מתמשכות של עובדות, שקרים, טענות\n' +
            'שהצד השני מאבדים את שפיותם, מדמיינים או הוזים.'
    }
];

export const phones = [
    {
        name: 'קו החירום 24/7 של עמותת ל.א לאלימות' ,
        phone: '6724*'
    },
    {
        name:
            'קו החירום הארצי למניעת אלימות במשפחה (בשפות: עברית, רוסית, אמהרית, ערבית)',
        phone: '1-800-220-000'
    },
    {
        name:
            'קו החירום הארצי לילדים בסיכון (בשפות: עברית, רוסית, אמהרית, ערבית)',
        phone: '1-800-200-000'
    },
    {
        name: 'מרכזי הסיוע לנפגעות ונפגעי תקיפה מינית',
        phone: 'נשים: 1202, גברים: 1203 (מכל טלפון, בכל הארץ)'
    },
    { name: 'קו סיוע לנשים מהמגזר החרדי', phone: '02-6730002' }
];
