timestamp = 'timestamp'
whatTriggeredChange = 'whatTriggeredChange'
howDidYouManged = 'howDidYouManged'
additionalnfo = 'additionalnfo'
mail = 'mail'
whatHelpedYou = 'whatHelpedYou'
background = 'background'
storyContent = 'storyContent'
name = 'name'
initials = 'initials'
id = 'id'
tags = 'tags'
quote = 'quote'
date = 'date'
image = 'image'

mock_get_all_data = [
    {
        timestamp: '5/17/2020 0:10:43',
        whatTriggeredChange:
            'אחרי שנתיים שהיינו יחד הבת הבכורה שלו נפטרה. ולא משנה כמה הייתי שם, תמיד הוא עמר שאני לא נוכחת לא נמצאת, לא משקיעה , לא עושה - ראה רק שחור בי, אף פעם לא לבן. ואז הגעתי לעוד שבירה שמעוניינת לסיים את הקשר, היה שוב הסנריו הקבוע שממנו החלטתי לשים את כל הבייצים באותו סל ולהמר. עשיתי אולטימטום של לגור יחד ושאם זה יעשה לנו טוב - הרווחנו , ואם לא - אז זו תהיה פרידה סופית. אכן עברנו לגור יחד ובהתחלה זה עשה טוב ואז אחרי כמה חודשים זה נעשה רע מאוד כולל האלימות הפיזית. בשל הקושי הגדול שלו, הוא ביקש שנפצל חזרה בתים כי היה לו קושי גדול לגור עם ילדי  אבל עם דרישה שאבטיח שאנחנו נשאר ביחד. בקיצור של דבר, אני לא הייתי מסוגלת יותר, ובעצם אמרתי שאנו מפצלים בתים ונפרדים לתמיד. היה לו מאוד קשה לקבל את זה. הוא מאוד הקשה על תהליך האריזה והפיצול אבל זה קרה בסוף',
        howDidYouManged:
            'לא יכולה לומר שהתמודדתי טוב.. במהלך החמש השנים כל הזמן הייתי אומרת גם לו וגם למטפלת הזוגית שהלכנו אליה שהוא האוהב הכי גדול שלי והאויב הכי גדול שלי.  היו פעמים שהייתי מתחרפנת, היו פעמים שהייתי מכילה, היו פעמים שהייתי אובדת עצות ובעיקר חסרת אונים',
        additionalnfo:
            'זה בעיקר המודעות העצמית, כי בעיקר לא האמנתי לעצמי שאני בסיטואציה שכזו. ',
        mail: '',
        whatHelpedYou:
            'מכיוון שלא שיתפתי אף חברה ממש לאורך כל החמש שנים , הייתי צריכה להתחיל לשתף משם גם היה ברור שהן ראו המון דברים מהצד אבל פחדו לאבד אותי ולכן לא הביעו עמדה. בזכות התמיכה שלהן וההחלטה הברורה שהיה לנגד עיני שנחצה הקו האדום שלי שזה ילדי',
        background:
            'פרק ב, חמש שנים יחד כולל מגורים, התחיל לא בהבנה שלי שזה מה שקורה, בערך חודשיים מהרגע שהיינו יחד עד הסוף. הצלחתי לסיים את הקשר באוגוסט האחרון , מידי פעם עדיין צריכה להתמודד עם הודעות שלו אבל מצליחה להתמודד. בת 41',
        storyContent:
            'מערכת יחסים שונה שמעולם לא היתה לי. זה התחיל בהתמכרות להרגשת האהבה האינסופית שלו אלי. הכל היה סופר עוצמת. היתה כימיה פיזית שמעולם לא חוויתי והרצון שלו שכל הזמן נהיה יחד. כבר ממש בהתחלה היו לו כל מיני הערות וכל הזמן "זמן חינוך" של למה בפייסבוק, למה בטלפון, מי שולח הודעות והמון הערות. תמיד זה היה הופך לויכוח שאני מתייאשת בסופו ואומרת שמבינה שזה לא יכול לעבוד ושאי אפשר בכל, אנחנו שונים, חושבים, מתנהגים אחרת- זה היה מטריף אותו, הרצון שלי לפרוש וללכת- לא היה מאפשר לי ללכת, חוסם את המעבר לדלת, מחביא לי את התיק, המפתחות וכד/״... אם הייתי מספיק החלטית ומצליחה ללכת, היו 80 טלפונים,  מאבא סמסים, היה מסוגל להגיע באמצע הלילה ולדפוק בדלת שעל השכנים שומעים... בפעמים שלא היה מגיע, קרה לי לפחות פעמים שבבוקר 2 גלגלים באוטו מפונצ/״רים - ולא הייתי מבקשת את עזרתו אז היה מתעצבן שנעזרתי התיקון הפנצ/״רים בגרוש שלי. היתה תקופה שהיה אומר לי דברים שאני הבנתי מהם שהוא קורא את הוואטספים שלי, או יודע בדיוק איפה אני נמצאת )גיליתי בדיעבד שעשה שיתוף למקום שלי דרך הנייד(. היו כל כך הרבה אירועים שקשה לתאר זו כעדות כתובה... אך בשנה האחרונה האלימות הסלימה לפיזית שמצאתי את עצמי בורחת, שהוא בועט בדלת ושובר אותה כדי להגיע אלי, בסטירה שנותן לי. חשוב לציין שכל החמש שנים ניסיתי לעזוב ללא הצלחה, אני מקבילה זו למכור לסמים. אם כשעזבתי הוא היה מאפשר לי ועוזב אותי לנפשי - הייתי מצליחה,  אבל כל פעם שניסיתי לעזוב הוא היה רודף ומשכנע ואז מרעיף אהבה וכל פעם נשברתי מחדש. השיא שבעקבותיו הגעתי לחלטה שאני מצליחה לסיים את הקשר, היה ארוע אלים כאשר ילדי בבית, שהוא שבר לי צלחת ביד מעצבים בעקבות תשובה שעניתי לו. הגדול שלי נאלץ לבוא להיות לצידי כדי שהוא יתרחק. זה היה הקש האחרון שבעקבותיו התחלתי לחזק את עצמי במטרה לסיים סופית. הסיום הסופי היה 3 חודשים לאחר ארוע זה. ',
        name: 'גם אני',
        initials: 'ל',
        id: '15',
        tags: ['תמיכה ממעגלים קרובים', 'אלימות טכנולוגית', 'אלימות פיזית', 'פגיעה ברכוש', 'קנאה ואובססיביות'],
        quote: 'לא האמנתי לעצמי שאני בסיטואציה כזו'
    },
    {
        timestamp: '5/17/2020 19:08:31',
        whatTriggeredChange:
            'אחרי מספר פגישות עם הקואצ\'רית ,קיבלתי אומץ להביע את רצוני להתגרש.מאז עברתי את נועה דלרוזה של הגירושים.תביעות בלי סוף ובית המשפט הפך לבית השני שלי.הפכתי בחלק מהתיקים לעו"ד של עצמי והיום לי הצלחות אבל גם כישלונות.למדתי בתחום המשפט המון.',
        howDidYouManged:
            'הגוף שלי דיבר.סבלתי מעצירויות ודימומים.ניסיתי לאמר לחברות אבל אף אחד כולל הורי לא האמינו לי.כלפי חוץ היינו זוג מושלם.בלית ברירה המשכתי לשחק כאילו הכל מושל',
        additionalnfo:
            'מלכתחילה יש לתת הרצאות התיכוניים לבנות ולספק להם כלים לא ליצור קשר עם גברים מסוכנים.אני אשמח להתנדב בפרויקט כזה',
        image: '',
        mail: '',
        whatHelpedYou:
            '\nהחוזק הנפשי שלי, התמיכה הכלכלית של המשפחה והנפשית של החברות,.כמו כן עשיתי דברים שאני אוהבת.כמו לשמוע מוזיקה,לרכב על אופנים,לטייל ברגל,לרקוד ריקודי עם.',
        background:
            'כלפי חוץ-היינו זוג מושלם:\nבית יפה\n4 ילדים חמודים ובריאים\nמטיילים המון בארץ ובחול\nכסף לא חסר.\nהיינו נשואים 30 שנה\nהכרנו לפני כן 4 שנים\nהיינו בני 22-23 כשנישאנו\nכשהתגרשנו היינו בני 52.\nבערך ב-15 שנים לאחר הנישואים\nהתחילו לעלות בראשי \nמחשבות על גירושים.\nבפועל, אזרתי אומץ רק לאחר 15 שנה נוספות\nלקום וללכת לחיים חדשים.',
        storyContent:
            '',
        name: 'ענבר נמרא',
        initials: 'ע.נ.',
        id: '1',
        tags: ["מניפולציות וגזלייטינג", "אלימות רגשית", "ניתוק / התנתקות מחברים ומשפחה", "קנאה ואובססיביות", "בגידות",
               "להטב", "אלימות מילולית", "רשויות"],
        quote: 'הגסלייטינג היה שם מהרגע הראשון. כך גם ההתחזויות שלו.  הפרופיל שלו בטינדר עדיין פעיל. הוא מחפש קורבנות נוספים.'
    },
    {
        timestamp: '5/15/2020 11:23:07',
        whatTriggeredChange:
            '',
        howDidYouManged:
            '',
        additionalnfo:
            '',
        mail:
            '',
        whatHelpedYou:
            '',
        background:
            '',
        storyContent:
            '',
        name: 'דיקלה',
        initials: 'ד',
        id: '2',
        tags: ["אלימות רגשית", "אלימות פיזית", "רשויות", "טיפול פסיכולוגי"],
        quote: 'חשבתי להתגרש , כשרציתי כבר זה נהייה מסוכן ואלים.'
    },
    {
        timestamp: '5/15/2020 11:23:07',
        whatTriggeredChange:
            '',
        howDidYouManged:
            '',
        additionalnfo:
            '',
        mail:
            '',
        whatHelpedYou:
            '',
        background:
            '',
        storyContent:
            '',
        name: 'ע',
        initials: 'ע',
        id: '3',
        tags: ["איומים ואיומים בנשק", "קנאה ואובססיביות", "מניפולציות וגזלייטינג", "תקופות \"ירח דבש\"", "אלימות פיזית",
               "פגיעה ברכוש", "ניתוק / התנתקות מחברים ומשפחה", "הפחדה", "אלימות מינית", "אלימות רגשית",
               "תמיכה ממעגלים קרובים", "העצמה אישית"],
        quote: 'לא הבנתי כמה מערכת היחסים הזאת לא בריאה, כשהבנתי כבר היה מאוחר מדי.'
    },
    {
        timestamp: '5/15/2020 11:23:07',
        whatTriggeredChange:
            '',
        howDidYouManged:
            '',
        additionalnfo:
            '',
        mail:
            '',
        whatHelpedYou:
            '',
        background:
            '',
        storyContent:
            '',
        name: '',
        initials: 'ל',
        id: '4',
        tags: ["תקופות \"ירח דבש\"", "אלימות כלכלית", "אלימות מילולית", "עדויות ילדים", "ניתוק / התנתקות מחברים ומשפחה",
               "איומים ואיומים בנשק", "עונשים ונקמה", "משטרה", "פגיעה ברכוש", "אלימות פיזית", "רשויות",
               "בתי משפט וצווי הרחקה", "הפחדה", "הריון לידה והפלה", "טיפול פסיכולוגי", "עדויות ילדים"],
        quote: 'תלונות שלי במשטרה המקומית נסגרות מיידית. צווי הרחקה כנגדו, מופרים פעמים רבות, בלי שום סנקציה.'
    },
    {
        timestamp: '5/15/2020 11:23:07',
        whatTriggeredChange:
            '',
        howDidYouManged:
            '',
        additionalnfo:
            '',
        mail:
            '',
        whatHelpedYou:
            '',
        background:
            '',
        storyContent:
            '',
        name: 'בדוי',
        initials: 'ג',
        id: '5',
        tags: ["אלימות מילולית", "אלימות פיזית", "אלימות רגשית", "הפחדה", "ניתוק / התנתקות מחברים ומשפחה",
               "קנאה ואובססיביות", "בתי משפט וצווי הרחקה", "עדויות ילדים", "הפחדה", "מניפולציות וגזלייטינג",
               "תמיכה ממעגלים קרובים", "טיפול פסיכולוגי", "העצמה אישית"],
        quote: 'לא באחריותי ואין שום דבר בעולם שיכולתי לעשות כדי שיגיע לי יחס כזה ואינני לוקחת בעלות עליה.'
    },
]

mock_get_stories_by_tags = [
    {
        timestamp: '5/17/2020 19:00:07',
        whatTriggeredChange:
            "הוא טען שאני זו שצריכה פסיכולוג אז קיבלתי את עצתו והלכי לקואצ'רית.היא הבהירה לי שהפחד להתגרש צריך לשמור עלי לא לנהל לי את החיים.הבנתי שעלי להתגבר ולצאת לדרך.",
        howDidYouManged:
            'אני אישה מאד אופטימית אבל אם נשווה את תמונותיייה אז והיום,זה ממש לא אותה אישה.הגוף שלי דיבר במקומי.סבלתי מעצירויות ודימומים קשים.',
        additionalnfo:
            'שאחרי יום שחור תמיד תזרח השמש.לנו הנשים יש חוכמה ייצרה וחוזק נפשי.תמצאי לך את החברות הטובות שיתמכו בך ותעשי רק מה שאת אוהבת.אני היום בזוגיות שניה כבר 10 שנים ב", מאושרת בחלקי.יש לי ילדים נהדרים ונכדות מקסימות ויש בריאות טובה ואני כיום מתנדבת במכון רקמן בפרוייקט אישה לצידך הנותן אוזן קשבת לנשים בהליכי פרידה.אני עוזרת ומייעצת מניסיוני האישי ככל הניתןעצתי היא לתת הרצאות בבתי ספר לבנות מהם סימני האזהרה מפני גברים אלימים.לא לחשוב בטעות שקנאה מוגזמת היא אהבה כפי שאני חשבתי בטעות 30 שנה.',
        image: '',
        mail: 'dgntfalk98@gmail.com',
        quote:
            'אישה חזקה. מצליחה. מרוויחה טוב. יפייפיה. כל יום חוזרת הביתה והופכת לאפס',
        whatHelpedYou:
            '\nהחוזר הנפשי שלי, התמיכה הכלכלית של המשפחה והנפשית של החברות,.כמו כן עשיתי דברים שאני אוהבת.כמו לשמוע מוזיקה,לרכב על אופנים,לטייל ברגל,לרקוד ריקודי עם.',
        background:
            'כלפי חוץ-היינו זוג מושלם:\nבית יפה\n4 ילדים חמודים ובריאים\nמטיילים המון בארץ ובחול\nכסף לא חסר.\nהיינו נשואים 30 שנה\nהכרנו לפני כן 4 שנים\nהיינו בני 22-23 כשנישאנו\nכשהתגרשנו היינו בני 52.\nבערך ב-15 שנים לאחר הנישואים\nהתחילו לעלות בראשי \nמחשבות על גירושים.\nבפועל, אזרתי אומץ רק לאחר 15 שנה נוספות\nלקום וללכת לחיים חדשים.',
        storyContent:
            'בעלי בגד בי כנראה במשך כל שנות הנישואין.\nאני ידעתי בוודאות רק בעשור האחרון\nשבו כבר היתה לו מאהבת עם ילד.\nהיא היתה גויה לא מהארץ\nוהוא היה נוסע אליה כל סוף חודש\nל-10 ימים.בשבילי היו אלה ימי החופש\nהכי כיפים.הוא לא התקשר-טען שאין לו אינטרנט,\nואני חגגתי בבילויים עם חברות ומשפחה.\nכשרציתי להתגרש, גרר אותי לטיפול זוגי.\nהיכחיש שיש לו יחסים אינטימיים וילד גם לפסיכולוגית.היה מניפולטור.תמיד האשים אותי.\nמאז שנישאנו הוא היה קנאי נוראי.תמיד האשים אותי בבגידות שלא היו ולא נבראו.לכל טלפון שלו הייתי חייבת לענות שאם לא כן הוא היה מעניש אותי.\nלמשל פעם לא הלך איתי לחתונה של חברים שלנו.\nלא קיבל הסברים של בטריה נגמרה או ששכחתי ברכב את הטלפון. \n',
        name: 'הלביאה',
        id: '17',
        tags: ['אלימות מילולית', 'קנאה'],
    },
    {
        timestamp: '5/17/2020 19:08:31',
        whatTriggeredChange:
            'אחרי מספר פגישות עם הקואצ\'רית ,קיבלתי אומץ להביע את רצוני להתגרש.מאז עברתי את נועה דלרוזה של הגירושים.תביעות בלי סוף ובית המשפט הפך לבית השני שלי.הפכתי בחלק מהתיקים לעו"ד של עצמי והיום לי הצלחות אבל גם כישלונות.למדתי בתחום המשפט המון.',
        howDidYouManged:
            'הגוף שלי דיבר.סבלתי מעצירויות ודימומים.ניסיתי לאמר לחברות אבל אף אחד כולל הורי לא האמינו לי.כלפי חוץ היינו זוג מושלם.בלית ברירה המשכתי לשחק כאילו הכל מושל',
        additionalnfo:
            'מלכתחילה יש לתת הרצאות התיכוניים לבנות ולספק להם כלים לא ליצור קשר עם גברים מסוכנים.אני אשמח להתנדב בפרויקט כזה',
        image: '',
        mail: '',
        quote:
            'אישה חזקה. מצליחה. מרוויחה טוב. יפייפיה. כל יום חוזרת הביתה והופכת לאפס',
        whatHelpedYou:
            '\nהחוזק הנפשי שלי, התמיכה הכלכלית של המשפחה והנפשית של החברות,.כמו כן עשיתי דברים שאני אוהבת.כמו לשמוע מוזיקה,לרכב על אופנים,לטייל ברגל,לרקוד ריקודי עם.',
        background:
            'כלפי חוץ-היינו זוג מושלם:\nבית יפה\n4 ילדים חמודים ובריאים\nמטיילים המון בארץ ובחול\nכסף לא חסר.\nהיינו נשואים 30 שנה\nהכרנו לפני כן 4 שנים\nהיינו בני 22-23 כשנישאנו\nכשהתגרשנו היינו בני 52.\nבערך ב-15 שנים לאחר הנישואים\nהתחילו לעלות בראשי \nמחשבות על גירושים.\nבפועל, אזרתי אומץ רק לאחר 15 שנה נוספות\nלקום וללכת לחיים חדשים.',
        storyContent:
            'בעלי בגד בי כנראה במשך כל שנות הנישואין.\nאני ידעתי בוודאות רק בעשור האחרון\nשבו כבר היתה לו מאהבת עם ילד.\nהיא היתה גויה לא מהארץ\nוהוא היה נוסע אליה כל סוף חודש\nל-10 ימים.בשבילי היו אלה ימי החופש\nהכי כיפים.הוא לא התקשר-טען שאין לו אינטרנט,\nואני חגגתי בבילויים עם חברות ומשפחה.\nכשרציתי להתגרש, גרר אותי לטיפול זוגי.\nהיכחיש שיש לו יחסים אינטימיים וילד גם לפסיכולוגית.היה מניפולטור.תמיד האשים אותי.\nמאז שנישאנו הוא היה קנאי נוראי.תמיד האשים אותי בבגידות שלא היו ולא נבראו.לכל טלפון שלו הייתי חייבת לענות שאם לא כן הוא היה מעניש אותי.\nלמשל פעם לא הלך איתי לחתונה של חברים שלנו.\nלא קיבל הסברים של בטריה נגמרה או ששכחתי ברכב את הטלפון. \n',
        name: 'לביאה',
        id: '18',
        tags: ['אלימות מילולית', 'קנאה'],
    },
]

mock_get_all_tags = [
    'אלימות מינית',
    'אלימות כלכלית',
    'אלימות טכנולוגית',
    'אלימות פיזית',
    'אלימות מילולית',
    'איומים ואיומים בנשק',
]

mock_get_tags_map = {
    1: 'אלימות מינית',
    2: 'אלימות כלכלית',
    3: 'אלימות טכנולוגית',
    4: 'אלימות פיזית',
    5: 'אלימות מילולית',
    6: 'איומים ואיומים בנשק',
    7: 'פגיעה ברכוש',
    8: 'אלימות רגשית',
    9: 'קנאה ואובססיביות',
    10: 'בגידות',
    11: 'מניפולציות וגזלייטינג',
    12: 'תקופות "ירח דבש"',
    13: 'עונשים ונקמה',
    14: 'הפחדה',
    15: 'ניתוק / התנתקות מחברים ומשפחה',
    16: 'תלות וחוסר עצמאות',
    17: 'הריון לידה והפלה',
    18: 'משטרה',
    19: 'רבנות',
    20: 'מקלט לנשים מוכות',
    21: 'רשויות',
    22: 'בתי משפט וצווי הרחקה',
    23: 'דיכאון',
    24: 'בדידות',
    25: 'פוסט טראומה',
    26: 'עדויות ילדים',
    27: 'להטב',
    28: 'טיפול פסיכולוגי',
    29: 'תמיכה ממעגלים קרובים',
    30: 'העצמה אישית'
}

mock_get_public_stories = [
    {
        date: '13.02.20',
        quote:
            'האלימות השקטה, אי אפשר לראות אבל היא גומרת אותך מבפנים',
        name: 'יעל יהודה',
        tags: ['אלימות פיזית', 'אלימות מילולית', 'אלימות רגשית', 'מניפולציות וגזלייטינג', 'עונשים ונקמה', 'הפחדה',
               'תמיכה ממעגלים קרובים'],
    },
    {
        date: '13.02.20',
        quote:
            'מבחורה אנרגטית שהיתה בלב הקליקה החברתית, הוא הפך אותי לעכבר.',
        name: 'אינגה גל מדורסקי',
        tags: ['איומים ואיומים בנשק', 'תמיכה ממעגלים קרובים', 'הפחדה', 'עונשים ונקמה', 'הפחדה', 'אלימות מילולית',
               'אלימות רגשית'],
    },
    {
        date: '13.02.20',
        quote: 'הוא איים שיחזיר אותי לאמא שלי בשקיות שחורות',
        name: 'שרית קרול',
        tags: ['אלימות רגשית', 'איומים ואיומים בנשק', 'אלימות פיזית', 'אלימות כלכלית', 'עדויות ילדים'],
    },
    {
        date: '13.02.20',
        quote:
            'אפשר לצאת מזה',
        name: 'יעל לויתן',
        tags: [],
    },
]

keys_map = {
    'Timestamp': 'timestamp',
    'איך הסיטואציה השתנתה?': 'whatTriggeredChange',
    'איך התמודדת עם המצב?': 'howDidYouManged',
    'בכמה משפטים, מה הכי היית רוצה לומר למי שבמצב דומה?': 'additionalnfo',
    'במידה ובחרת לפרסם תחת שמך המלא, אפשר לצרף לעדות גם תמונה שלך': 'image',
    'Email Address': 'mail',
    'כתובת מייל ליצירת קשר (לא חובה, לא יפורסם באתר)': 'mail',
    'מה עזר לך להתמודד?': 'whatHelpedYou',
    'נשמח לדעת כמה פרטי רקע לסיפור (מה היה טיב מערכת היחסים, מתי זה קרה, לאורך כמה זמן, גיל וכו׳)': 'background',
    'סיפור העדות שלך': 'storyContent',
    'תחת איזה שם היית רוצה שהסיפור יפורסם? (שמך המלא או באופן אנונימי/בדוי)': 'name',
    'מספר': 'id',
    'תגיות רלוונטיות': 'tags',
    'משפט נבחר לציטוט': 'mainSentences'
}
