const proxy = {
    // 'GET /mock/getAllData': [
    //     {
    //         timestamp: '5/15/2020 11:23:07',
    //         whatTriggeredChange: 'גיליתי את האמת. ברחתי כל עוד נפשי בי.',
    //         howDidYouManged:
    //             'כשהייתי בתוך הקשר, ניסיתי לעזור לו. לטפל בו. לשנות אותו. ברגע שהבנתי שמדובר במתחזה פסיכופת ניתקתי קשר מייד. אחרי חודש וחצי כבר היינו גרושים.',
    //         additionalnfo:
    //             'את לא צריכה לטפל באף אחד אחר. זאת לא המטרה במערכת יחסים זוגית. אל תתני לאף אחד להכתיב לך ולהשתלט לך על החיים. תסמכי על שיקול הדעת שלך, גם אם הוא אומר לך שמדובר בשטויות ומה פתאום את חושבת דברים כאלה.',
    //         image:
    //             'https://drive.google.com/open?id=1k-P_TDbas18pe-fmApN1xpi9O_3jSuxv',
    //         mail: 'inbar.rabinovitch@gmail.com',
    //         whatHelpedYou:
    //             'תמיכה של חברות, בת זוג, פסיכולוגית, ובעיקר מעגל תמיכה שיצרתי עם שאר הקורבנות שלו. היתה לנו קבוצת ווטסאפ ששיתפנו בה תחושות, מחשבות וקשיים.',
    //         background:
    //             'מדובר במערכת יחסים שנמשכה 9 שנים - גיל 25 עד 34. היינו נשואים במשך 6 מתוכן. הגסלייטינג היה שם מהרגע הראשון. כך גם ההתחזויות שלו. ',
    //         storyContent:
    //             '\nכתבתי את העדות הזאת כפוסט בפייסבוק, ששותף די הרבה (אבל לא מספיק). מאז שכתבתי את הפוסט הזה לפני כחצי שנה, שתי נשים נוספות יצרו איתי קשר בזכותו. שתיהן היו בקשר ״מונוגמי״ ורציני איתו. אחת ב-2017-2018, והשניה במשך רוב 2011. הוא ניסה לחזור לקשר איתה עד 2013, אחרי שכבר התחתנו.\n\nהפרופיל שלו בטינדר עדיין פעיל. הוא מחפש קורבנות נוספים.\n\nתוכן הפוסט המקורי:\n\nאמ;לק: נשים*, אזהרה חמורה מהאיש הזה, שהתעלל בי ועשה לי גסלייטינג במשך 9 שנים, והיה הצד המתעלל בלפחות 5 מערכות יחסים נוספות ב-10 השנים האחרונות.\n\nתכירו את אלון וגנר. קצין וראש צוות לשעבר ב-8200, סיים בהצטיינות יתרה, בו זמנית, 2 תארים שניים באוניברסיטת ת״א (מדעי המחשב וארכיאולוגיה), התקבל לדוקטורט במדעי המחשב ב-5 אוניברסיטאות עילית בארה״ב (ביניהן: MIT, סטנפורד וברקלי), מסיים השנה דוקטורט במדעי המחשב באוניברסיטת ברקלי בקליפורניה.\n\nמציג את עצמו כבחור צנוע, רגיש, חנון חמוד שלא יכול לפגוע בזבוב.\n\nפגשתי אותו באוגוסט 2010 והתאהבתי עד מעל הראש. חשבתי שהיה בינינו חיבור מיידי, עם שפה משותפת ובדיחות משותפות, וגם הבנה ואהבה רבה. זה גם מה שהוא שידר לי נונסטופ. הוא אמר לי כמעט מידי יום בקצת יותר מ-9 השנים האחרונות שהוא אף פעם לא הרגיש כלפי אף אחת את מה שהוא מרגיש כלפיי; שמעולם לא היו לו ספקות לגביי; שאני החבר.ה הכי טוב.ה שלו; שהדבר היחיד שהוא מעולם לא התחרט עליו הוא ההחלטה להתחתן איתי.\n\nכן, עשיתי את הטעות של להתחתן איתו. יוני 2013. קפריסין. כשנה אח״כ עברתי איתו לארה״ב, כשהתחיל ללמוד לקראת הדוקטורט בברקלי.\n\nהיו דגלים אדומים לאורך כל מערכת היחסים בינינו, ובחרתי להתעלם מהם רוב הזמן. הוא אמר לי, בצמוד לכמה שהוא אוהב אותי, שאין לו כלום בחיים חוץ ממני ומהעבודה שלו. הוא היה מפרצף לי כשרציתי לצאת מהבית לפגוש חברות; היה מתחנן אליי בפרצוף עצוב: ״בבקשה אל תעזבי אותי״ - בכל. פעם. שיצאתי. כן, גם ליציאה של שעתיים-שלוש עם חברות. הוא היה מסתובב בבית ואומר: ״בא לי למות״ - כביכול בלי לשים לב. התמודד עם חרדות ודיכאון וסירב ללכת לטיפול עד לפני כשנתיים וחצי.\nהוא היה לא החלטי בצורה קיצונית. הוא התלבט במשך כשנתיים בקשר למעבר לארה״ב, ואז בטיסה לשם, תוך כדי המעבר, אמר לי שהוא עשה טעות והוא לא רוצה לעבור. הוא סירב ש״נתמקם״ כמו שצריך בארה״ב - החל מריהוט הבית (קנינו רק את הדברים הבסיסיים שצריך, את השאר קיבלנו כתרומה; למרות שהיה לנו כסף לקנות ריהוט. הבית היה ריק ו״ערום״), וכלה בקניית רכב. גרתי איתו במדינה זרה במשך שנתיים וחצי, כשמעל הראש תמיד ריחף ה״איום״ של החזרה לארץ, מה שכביכול יכול לקרות בכל רגע. מעולם לא הייתי צד בהחלטה אם להישאר או לעזוב.\nמעולם, ב-9 שנים, לא ראיתי אותו בוכה.\nיש עוד הרבה סיפורים על התקופה ההיא שלא אלאה אתכן בהם כרגע.\n\nבתחילת 2017 נפרדנו וחזרתי לגור בארץ (הוא עדיין גר בקליפורניה), אבל לא התגרשנו. לאחר כחצי שנה חזרנו להיות בקשר רומנטי, אבל עם הסכם ברור: אנחנו חוזרים לקשר פוליאמורי, ובו התנאי הכי בסיסי הוא שכל בנות הזוג של כל אחד.ת מאיתנו יודעות על כל שאר בנות הזוג, וכולן יודעות שאנחנו נשואים.\n\nהוא סיפר לי על נשים אחרות שהיה איתן בקשר. אם אני זוכר.ת נכון, מדובר בסה״כ בכ-4 נשים חוץ ממני. כמו שקורה בהרבה קשרים פוליאמוריים, שנינו התמודדנו עם קנאה. אבל הוא היה מרגיע אותי ואומר לי שרק בי הוא מעוניין רומנטית; עם כל האחרות מדובר על קשרים שאין בהם דבר מלבד ידידות פושרת וסקס.\n\nכשרק חזרנו לקשר, רציתי מאוד לחזור לחיות איתו בארה״ב. דיברנו על זה הרבה והוא כל הזמן אמר שעוד לא הגיע הזמן; שהוא רוצה להיות בטוח במערכת היחסים בינינו לפני שנעשה את הצעד הזה.\nאחרי כשנה התייאשתי והתחלתי לבנות את החיים שלי בארץ, כי נמאס לי לחכות. אחרי שזה קרה, הוא אמר פעם אחר פעם כמה מעציב אותו שאני מתמקמ.ת בארץ, וכמה שהוא רוצה שנחזור לגור יחד. היה שר לי ״בואי הביתה״ שוב ושוב. אמר שהבית מרגיש ריק בלעדיי.\n\nבאוקטובר השנה, פנתה אליי מ׳, אחת מבנות הזוג שלו, וסיפרה לי את האמת. לאחר מכן, א׳, בת זוג נוספת, הצטרפה אליה.\n\nהתברר ש:\n\nהוא יצא עם שתיהן ברצף בשנתיים האחרונות, מסוף 2017. לי הוא אמר שהוא ו-מ׳ נפרדו לפני כחצי שנה וחזרו לקשר לאחרונה, ושהוא ו-א׳ נפרדו לפני כשנה.\n\nגם מ׳ וגם א׳ אינן פוליאמוריות, ולא ידעו האחת על השניה עד אוקטובר השנה.\n\nהוא תכנן חתונה עם שתיהן, לפרטי פרטים. הוא לקח מ-מ׳ טבעת אירוסין שעברה בירושה במשפחתה, כדי להציע נישואין ״כמו שצריך״. היא אפילו קנתה שמלת כלה.\n\nהוא דיבר גם עם מ׳ וגם עם א׳ בשנה האחרונה על מעבר לגור יחד, ותכנן זאת לפרטים (כולל תאריכים).\n\nכשכל אחת מהן בנפרד גילתה על קיומי, הוא סיפר להן שאני אקסית שעדיין אובססיבית כלפיו\n\nהוא אמר להן שמעולם לא גרנו יחד\n\nהוא אמר שמעולם לא התחתנו, ושהוא אפילו מעולם לא שקל להתחתן איתי\n\nכש-א׳ השיגה תמונות מהחתונה שלנו, הוא אמר שהוא לא זוכר מה היה הטקס הזה, אבל זה בטוח לא חתונה\n\nהוא אמר שלקחתי את שם המשפחה שלו בלי הסכמתו רק כי לא אהבתי את שלי, בלי שום קשר לחתונה\n\nכשכל זה התברר, שלחתי לשתיהן צילום של ספח הת.ז. שלי, בו כתוב שאני נשוי.אה לו. בתגובה, אחרי שכבר הבטיח לשתיהן שהוא מפסיק לשקר, הוא אמר שהתחתנו רק בשביל ויזה לארה״ב, ובטח הלכתי לבד למשרד הפנים ורשמתי אותנו כנשואים ללא ידיעתו\n\nבפברואר 2019 הוא הזמין אותי לבוא איתו לסינגפור, ולבלות שם בזמן שהוא בכנס מקצועי. כש-א׳ גילתה שהייתי שם איתו, הוא סיפר לה בפרטי פרטים איך גיליתי בדרך-לא-דרך שהוא נוסע לכנס, והפתעתי אותו שם. הוא אמר לה שהוא סירב לבלות איתי כשהייתי שם. התמונות למעלה הן מהטיול ההוא; אין ספק שמדובר באדם מופתע שלא רצה להיות איתי ולטייל איתי, ושאני אקסית שרדפה אחריו לחצי השני של העולם והפתיעה אותו.\n\nהוא פספס את יום ההולדת שלי בסוף 2018, למרות שקבענו מראש שנהיה יחד בתאריך ההוא. בדיעבד מסתבר שהוא היה בארץ החל משבועיים לפני יום ההולדת שלי, עם מ׳, ולא סיפר לי. כשכעסתי עליו על פספוס יום ההולדת, הוא ״לקח טיסה ברגע האחרון״ ו״הגיע לארץ״ יום לאחר מכן.\n\nיצאתי מהארון כג׳נדרקוויר לפני כשנה. הוא שנא את זה וסירב בתוקף לדבר אליי בלשון הפניה המועדפת עליי. עם זאת, כשהוא דיבר עליי עם מ׳, הוא דיבר עליי בזכר בלבד כדי ללעוג לי ולהקטין אותי.\n\nהוא שכב עם כולנו בלי קונדום, ואמר לי שאני היחיד.ה שוכב איתו.ה בלי קונדום.\n\nכשעימתתי אותו עם חלק מהנ״ל, הוא טען בתוקף שהוא ראה את מ׳ אולי 5-10 פעמים בשנתיים שבהן היו בקשר. שהוא אמר לה שהוא אוהב אותה ורוצה להתחתן איתה רק כי היא אמרה קודם, והוא לא רצה לפגוע בה. לגבי א׳ הוא אמר שהיא משוגעת והוא רצה להיפרד ממנה מזמן, אבל לא היה לו אומץ. מיותר לציין שמדובר בשקרים מוחלטים, שניתן להוכיח בקלות.\n\nמן הסתם הקשר שלי איתו נגמר, הפעם באמת. גם הקשרים עם מ׳ ועם א׳ הגיעו לסוף דומה. לצערי, אני יודע.ת שנכון לאוקטובר 2019 הוא היה בקשר עם אישה נוספת באיזור סן פרנסיסקו, בשם פוג׳ה. אין לי הרבה פרטים לגביה ואין לי דרך ליצור איתה קשר ולהזהיר אותה. מה שאני יודע.ת הוא שמדובר באמריקאית ממוצא צפון-הודי, שעבדה עד לאחרונה בעמותה לקידום מיעוטים.\n\nאני לא פסיכולוג.ית או פסיכיאטר.ית, אבל די ברור לי שמדובר בסוציופת שמשתמש בנשים* על מנת לקבל הכלה, רחמים ומעטפת רגשית. הוא מעולם לא היה האיש שחשבתי שהוא, והוא שיקר לי ועשה לי גסלייטינג במשך 9 שנים. בגלל האיום של החזרה לארץ / התקווה שהוא נטע בי לחזור לגור איתו בארה״ב, נשארתי לעבוד מהבית כפרילנסר.ית, למרות שכבר לא הרגשתי סיפוק בעבודה; רק כי כפרילנסר.ית יהיה לי יותר קל לעבור ארץ. בנוסף לכל השקרים הרבים, הוא דאג לכך שלא אתפתח מקצועית, ושהדימוי העצמי שלי ישאר נמוך בעקבות כך. הוא העדיף כנראה להשאיר אותי קטנ.ה וצייתנ.ית.\nבעקבות השיחות שלי עם בנות זוגו האחרות, למדתי שיש פרופיל אותו הוא מטרגט: נשים* פמיניסטיות מאוד אך חסרות ביטחון, שנוהגות לטפל באחרים ולדאוג להם.\n\nבבקשה, שימרו על עצמכן מפניו ושתפו את הפוסט הזה לכל עבר, כדי שאף אישה* לא תיפגע שוב מהאיש הזה.',
    //         name: 'שמי המלא - ענבר נמרא',
    //         id: '1',
    //         tags: ['אלימות מילולית', 'קנאה']
    //     },
    //     {
    //         timestamp: '5/15/2020 12:10:13',
    //         whatTriggeredChange:
    //             'כאשר אמרתי מה אני רוצה ולא הסכמתי חמה שהוא רצה התחילה האלימות',
    //         howDidYouManged:
    //             'הלכתי לבית רני בהוד השרון ששם עוזרים לנשים שנמצאות במצב של אלימות עם הבעל ואמרו שיקח זמן ואז אחרי חודש הוא התחיל להרביץ ולשבור דברים בבית הזמנתי משטרה ואמרו לי לבוא למשטרה לקחתי את הילדים איתי והחכתי למשטרה ואז ביקשו ממנו לבוא והוא היה במאסר יום והורחר מהבית חמאס אני בוגרת נועלת את את הבית היטב התגרשנו לפני שנה בעזרת עורך דין והרבנות שאמרו לו שהוא סרבן ולא נתנו לו לצאת עד שחתם שאנחנו גרושים פעמיים הוא הורחק מהבית וחזר דוב ורק בסוף הרגשתי את האלימות והפחד ממש ועכשיו נשאר למכור את הבית חשוב אני נזהרת מאד סוגרת את על הבית',
    //         additionalnfo:
    //             'שתלך לטיפול פסיכולוגי שתבין את המצב שהיא נמצאת בו למרות שנראה לה שהיא חזקה אני עבדתי והחזקתי את הבית עדיין צריך עזרה להתמודד עם זה וכמובן עורך דין טוב וסבלני',
    //         image: '',
    //         mail: 'etis1959@gmail.com',
    //         whatHelpedYou:
    //             'בית רני להבין שאני מוכה וצריכה להיחלץ מהמצב לקח זמן עד שהבנתי את המצב ושאני צריכה להתגרש ממנו כי תמיד רציתי משפחה והיה קשה להבין את המצב שאני נמצאת בו',
    //         background:
    //             'התחתנתי בגיל 35 ומאד שמחתי שהוא אוהב כל מה שאני אוהבת שהוא תומך אוהב תוך חצי שנה התחתנו ולא הכרתי דום דבר בחייו',
    //         storyContent:
    //             'סיפור שנמשך 15 שנים וה5 שנים האחרונות היו קשות כי חשבתי להתגרש כשרציתי כבר זה נהייה מסוכן ואלים',
    //         name: 'דיקלה',
    //         id: '2',
    //         tags: ['אלימות מילולית', 'קנאה'],
    //     },
    //     {
    //         timestamp: '5/15/2020 15:04:02',
    //         whatTriggeredChange:
    //             'הסיטואציה השתנתנה לאחר האונס, לקח לי המון שנים להבין את זה שחוויתי אונס על ידי בן הזוג שלי אבל החוויה הזאת השםיע עליי מאוד וגרמה לי לראוץ אותו באור שונה.',
    //         howDidYouManged: '',
    //         additionalnfo:
    //             ' את חזקה ממנו, הוא זה שחלש. הוא צריך אותך, את לא צריכה אותו. תברחי. המצב לא ישתפר, אלא רק יסלים',
    //         image: '',
    //         mail: '',
    //         whatHelpedYou:
    //             'הזמן, התמיכה של המשפחה שלי וזה שידעתי שהוא לא בארץ בשביל לפגוע בי או בקרובים אליי. ',
    //         background:
    //             'הייתי בת 15, מערכת היחסים נמשכה כשנה וחצי ועוד שנה של הטרדות ואיומים ',
    //         storyContent:
    //             'הכרנו כשהייתי בערך בת 15 וחצי, הוא היה בן 19. נפגשנו במפגש עם כמה חברים משותפים במקום ציבורי, כשהוא ראה אותי הוא הכריז "היא שלי". בתור ילדה רק בת 15 מאוד הוחמאתי, חשבתי שככה נראית אהבה ואחרי מסע שיכנועים וחיזורים של כמה שבועות הסכמתי לצאת איתו. כבר מההתחלה הוא היה מאוד קנאי, שאל עם כמה בנים שכבתי, בדק עם מי אני מדברת בפייסבוק וניתק אותי מכל החברות שלי והמשפחה שלי לאט לאט. אני חייבת להגיד שבהתחלה לא הבנתי כמה מערכת היחסים הזאת לא בריאה, כשהבנתי כבר היה מאוחר מדי. מלבד האובססיה אחרי חצי שנה בערך התחילה גם אלימות פיזית, יום אחד חזרתי מביה"ס ובאתי ישר לדירה שלו הוא חיטט לי בתיק (מה שהיה בשגרה) ומצא קונדום. הסברתי לו שהיה לנו שיעור חינוך מיני בביה"ס וחילקו קונדומים לכולם, הוא לא הקשיב הוא החליט שבגדתי בו, הוא נתן לי סטירה והפיל אותי למיטה, אחכ הוא השאיר אותי בחדר שעה לבד בזמן שבכיתי ובא להתנצל. תקופות "הירח דבש" איתו היו מטורפות, הוא היה קונה לי דברים, לוקח אותי למקומות ומשקיע בי את כל הזמן הפנוי שהיה לו. אני לא לקחתי את זה כמובן מאליו, זאת הייתה אהבה ראשונה שלי והוא כל הזמן אמר לי שאני לא אמצא מישהו אחר שיתנהג אליי יפה כל כך ואני האמנתי. האלימות המשיכה, והכל התפוצץ אחרי שיום אחד הוא אנס אותי, היינו בבית שלו ואח שלו ישן בחדר הוא לקח אותי למזרן שהיה על הרצפה באותו החדר וניסה לשכב איתי. אמרתי לו שאני לא רוצה, שאח שלו בחדר ושזה מביך אותי, הוא לא הרפה. במהלך כל התקופה ההורים המדהימים שלי ידעו מה קורה ועשו הכל בשביל חמנוע ממני להיפגש איתו, אבל אין הרבה מה לעשות עם ילדה מרדנית בת 16. \nאחרי שנתיים אזרתי אומץ ונפרדתי ממנו, הוא לא קיבל את זה יפה, הוא ישר שאל אם יש לי מישהו אחר ואיים על כל החברים שלי שהתרחקו ממני שוב. אחרי שהוא שיחרר אותי סוף סוף, הוא היה מסתובב מחוץ לבית הספר שלי, מדבר עם חברות שלי ושולח לי איומים על אחותי הקטנה ועל חברים שלי. הייתי יוצאת מהבית לזרוק את הזבל ורואה אותו, נפגשת עם חברות והוא היה שם, כל דבר שהייתי עושה הוא ידע ובמשך שנה הייתה לי תחושה שהוא עוקב אחריי תמיד. \nאחרי שהוא שלח לי איומים על אחותי הקטנה, פניתי לאבא שלי, אבא שלי דיבר איתו וקנה לו כרטיס טיסה למשפחה שלו, הוא טס, מאז אני תמיד חוששת להיתקל בו פתאום, תמיד שאני שומעת את השם שלו אני מתכווצת, אף אחד עד היום לא יודע מה באמת היה שם. ',
    //         name: 'ע',
    //         id: '3',
    //         tags: ['אלימות מילולית', 'קנאה'],
    //     },
    //     {
    //         timestamp: '5/15/2020 15:27:15',
    //         whatTriggeredChange: 'לא השתנתה.',
    //         howDidYouManged:
    //             'התגוננות תמידית, פחד תמידי, אובחנתי כסובלת מפוסט-טראומה. שורדת אבל בקושי רב מאד.',
    //         additionalnfo:
    //             'לא לסמוך על משטרה, לא לסמוך על רווחה, לא לסמוך על פקידת סעד, ולא על בית משפט, ולא על פרקליטות. לשלוח את אבא שלך להרביץ לו. זה שווה את הכלא שאולי יבוא אחרי כן.',
    //         image: '',
    //         mail: '',
    //         whatHelpedYou: 'ההכרח להיות בריאה נפשית, גופנית וכלכלית עבור הילד.',
    //         background:
    //             "היינו כמו שני סיפורי הצלחה - יפים, מוכשרים, מצליחים. רק שאני הייתי תמימה. הכרנו בגיל 30 שלי, גרנו יחד, רצינו 5 ילדים, הרינו, הוא דחק בי להכנס לג'קוזי בצימר וההריון נפל. הרינו שוב, תוך שהוא משפיל אותי, רודה בי, דורש דוחות הוצאות, אלים מילולית אז, עוקב אחרי ומשפיל אותי. העזתי להפרד ממנו בהריון. ",
    //         storyContent:
    //             'הייתי האישה הראשונה שהיזה להפרד ממנו, לדבריו. מאז הפרידה, עשרות שנים של אלימות פיזית, התעללות נפשית מאסיבית בילד, שטופל בבית חולים נפשי בשל כך ופגוע עד היום, ובי, התעללות כלכלית, משפטית, תדמיתית, חברתית, משפחתית בכל כתב-עת, קבוצה, בפני הורי ילדים אחרים, שכנים, לקוחות ורשויות. מרדף אימה של נקמה, בלתי פוסק, ושלא ייגמר לעולם. נגנב לי דואר לעיתים, נשרף לי האוטו, מנוקבים צמיגים, הוכיתי קשות לעיני הילד, פעמים רבות, צולמתי, הוכפשתי. הילד הועף מכל מסגרת חברתית וחוגית בגלל לאחר הכפשות אבא שלו. שכנים נסחטים ומאוימים נגדי. אני סובלת מתלונות שווא משפטיות כמעט בכל רשות אפשרית. נשותיו המתחלפות מתחזות אליי בפני רשויות רפואית להוציא מידע לגביי. תלונות שלי במשטרה המקומית נסגרות מיידית. צווי הרחקה כנגדו, מופרים פעמים רבות, בלי שום סנקציה.',
    //         name: '"זה לעולם לא ייגמר"',
    //         id: '4',
    //         tags: ['אלימות מילולית', 'קנאה'],
    //     },
    //     {
    //         timestamp: '5/16/2020 12:07:32',
    //         whatTriggeredChange:
    //             'בסופו של דבר אמי עזרה אומץ ועזבה אותו ואני עזבתי איתה לדירה שכורה בגיל 15 לערך. אבי ניתק קשר לאורך שנים ומתישהו הקשר התחדש.',
    //         howDidYouManged:
    //             'שרדתי. סיפרתי לחברות. דרשתי גישה לטיפול פסיכולוגי. ',
    //         additionalnfo:
    //             'האדם הוא לא רק "תבנית נוף מולדתו", הוא הרבה הרבה מעבר לכך. חשוב להבין שהתנהגותם האלימה והפחדנית של אחרים היא לא באשמתי, לא באחריותי ואין שום דבר בעולם שיכולתי לעשות כדי שיגיע לי יחס כזה. בושה היא עוד תוצר של האלימות המופנית כלפיי והיא אינה שלי ואינני לוקחת בעלות עליה. אפשר וכדאי מאד לעבור הלאה כי החיים שלי קצרים ואני הגעתי לפה כדי להינות ולהגשים את עצמי ולא כדי לתקן אנשים אחרים. ',
    //         image: '',
    //         mail: 'NofarLasri1@gmail.com',
    //         whatHelpedYou:
    //             'אמפתיה , לב פתוח, הקשבה וסיוע במה שהיה ניתן מאנשים בסביבה הקרובה. הטיפול הפסיכולוגי עזר לאין שיעור. נשים חזקות שעמדו על שלהן היוו לי דוגמא ועוררו בי השראה שעזרה לי לצלוח את התקופה. נגישות של ספרים להשכלה עצמית וכן לתכנים דיגיטליים (סרטים, סדרות, פורומים וכו) שסייעו לי להבין שהמצב בבית לא כשורה ושמגיע לי עתיד טוב יותר. סיוע כלכלי שאיפשר לי להשתקם ולבנות לעצמי חיים אחרים. גם השירות הצבאי העצים אותי. ',
    //         background:
    //             'אבי מאובחן בהפרעת אישיות פרנואידית. לאורך כל חיי איים, קילל, התעלל באמי, באחי ובי פיזית ונפשית. כולנו בבית הלכנו על קצה האצבעות בגללו ובשביל שהוא לא יתעצבן.  אני באופן אישי עברתי בעיקר התעללות רגשית ומנטלית. ',
    //         storyContent:
    //             'בילדותי אמי בילתה את רוב יומה בעבודה או בכבישים בדרך לעבודתה. אבי עבד כמאבטח ושומר באופן לא סדיר. בבית ילדותי חוויתי והייתי עדה תכופות לגילויי אלימות פיזית, רגשית ומנטלית שכוונו נגד אחי, אמי וכלפיי. אחי נהג להגן עליי מפני אפיזודות אלימות של אבי (שאובחן מאוחר יותר כלוקה בהפרעת אישיות פרנואידית) ואף עשה מאמצים להסתיר ולחסוך ממני מה שהיה יכול. באחד המקרים שזכור לי היטב, היינו נעולים בחדר אחי ואני (כך אבי נהג לעשות כשהתעלל באמי בחדר השני) ואחי חיבק אותי חזק ואטם את אוזניי בידיו כדי שלא אשמע. \nכתלמידה בבית הספר ראיתי הצלחה בלימודים אך מבחינה חברתית היה לא פשוט. אבי הרגיש צורך להתערב ולקחת חלק באינטראקציות החברתיות שלי ושל אחי בבית הספר. הוא היה נוהג להתעקש ולדעת על כל ילד או ילדה איתו אנחנו מסתובבים וממש רצה להתערב ולקחת חלק בפעילויות באופן מוזר. הוא היה נוהג להפחיד אותי שוב ושוב להיזהר מבני אדם כי הם רעים, היה שופט כל אדם לרעה ולוקח את זה כעדות לכך שצריך "להחזיר לו" או "להיזהר מאד". אבי חייב אותי לומר לו כל עניין פעוט שקרה לי בבית הספר ונהנה מאד לרכל איתי על אחרים ולתאר תיאוריות שעולות בדעתו בהקשרם. כשחוויתי גילויי אלימות בבית הספר אבי נהג להתערב בצורה מאד אגרסיבית ואפילו איים באופן אישי על ילדים מכיתתי. אחת האמהות של ילדים אלה כמעט הגישה נגדו תביעה משפטית. אמי מצידה לא התערבה ואיפשרה לו להתנהל כדרכו. דרך התנהלותה הייתה מצד אחת רווית פחד ומצד שני מאפשרת ומשתפת פעולה. לשם הדוגמא, זכורה לי פעם אחת שסיפרתי בבית על בעיה שחוויתי עם אחד הילדים בבית הספר כדרכם של ילדים להתייעץ עם הוריהם. לאחר מכן, שלא בנוכחות אבי, אמי תקפה אותי בטון ביקורתי ומאשים ושאלה "למה סיפרת לו?!" ובעצם בכך העבירה אליי את האשמה לנטייתו התקופנית המוגזמת. בהזדמנויות אחרות הייתה מגנה עליו או מתריסה בו. \nעל אף החסרונות הניכרים שהיו באינטראקציה עם אבי כילדה, פעמים רבות נהניתי בחברתו ולמדתי ממנו המון. אהבתי להראות לו יצירות אומנות שציירתי או תעודות הצטיינות והוא תמיד שיבח אותי מאד והפגין גאווה.  הוא תמיד גיבה אותי בסיטואציות וכחניות אל מול בני המשפחה המורחבת ותמיד דאג להסיע אותי ממקום למקום ולפנק אותי במאכלים וממתקים שאני אוהבת. הרבה פעמים קיבלתי ממנו חיבוק ומילה טובה כשהייתי עצובה או מצוברחת ולרוב העדפתי לפנות אליו לקבלת עצה כי הוא היה קשוב וזמין לעומת אמי. לרוב תפיסתו של המציאות הייתה מנקודת מבט של יחסי כח ומרות אך הוא ידע גם להפגין סבלנות והתחשבות, לבקש סליחה ולהבין מה נדרש לעשות על מנת להשיג את מה שרוצים.      \nרגשות שליליים לא מעובדים (כעס, תסכול, עצב, קנאה, אשמה ובושה) ליוו אותי לבית הספר ויצרו קשיים בתקשורת עם עמיתיי ללימודים ועם הצוות החינוכי . אני מלאת הודיה לחברות הילדות שליוו אותי בילדותי ומשפחותיהן שאירחו אותי, סייעו לי והבינו בין השורות את מצוקתי. לצערי, על אף שהצלחתי לייצר אמפתיה למצבי בקרב חברותיי הקרובות ומשפחותיהן, חלק מהילדים בשכבת גילי פחדו לדבר איתי וחוויתי חוויות של נידוי חברתי. אירועים מסוג זה יצרו אצלי צער גדול ותחושת אשמה ובושה מאד עמוקים. עם זאת החוויות הללו פיתחו אותי כאדם מתבונן, מפייס, מתחשב וקשוב.  \nעקב המורכבות וההתנהלות הפוגענית בבית הוריי, הקשר שלי עם אמי נבנה בעיקר מחוץ לבית במהלך זמן שהיינו מבלות יחד שאבי לא היה נוכח. הפעילות העיקרית שהיינו עושות יחד הייתה לנסוע לקניות בדרום ת"א על מנת לחסוך בהוצאות, להביא מצרכי מזון ולבקר את סבתי. אלה היו זמנים שבילינו בנעימים וכך נחשפתי למאפיינים נוספים של אמי כמו דבקות במטרה, חריצות, מסירות וחמלה. בנוסף היא הייתה לוקחת אותי איתה לעבודה כשהתאפשר וכך ראיתי אותה ולמדתי ממנה בסביבה המקצועית שבה עבדה. \n',
    //         name: 'בדוי',
    //         id: '5',
    //         tags: ['אלימות מילולית', 'קנאה'],
    //     },
    //     {
    //         timestamp: '5/16/2020 17:42:34',
    //         whatTriggeredChange: 'ועוד בהמשך הפכנו להיות חברים. למה??!',
    //         howDidYouManged:
    //             'הייתי המומה. אבל לא הלכתי. נכנסתי אליו הביתה. למה??!! ',
    //         additionalnfo:
    //             'הייתי רוצה לחזור בזמן ולקום וללכת. הייתי רוצה שכל אחת במצב כזה תמצא כח ותבין שהיא לא צריכה להישאר שם עוד רגע.',
    //         image: '',
    //         mail: '',
    //         whatHelpedYou:
    //             'חושבת שלא התמודדתי. לא יודעת לענות על מה ולמה... הייתי אחת הנערות הכי מחוזרות בשכבה. כולם התפלאו שאני איתו. עד היום חברים מנעורי מביעים פליאה: מה עשית איתו?! ',
    //         background:
    //             'הייתי בת 17. הוא היה החבר הראשון שלי. אפילו עוד לא לגמרי היינו פורמאלית בהגדרה מול העולם. מישהו סיפר לי משהו..אולי שיש לו מישהי אחרת בנוסף? לא לגמרי בטוחה.',
    //         storyContent:
    //             'הגעתי אליו הביתה כועסת. כבר כשפתח את הדלת הבנתי שהידיעה הקדימה אותי. כנראה אותו חבר התקשר להזהיר-להתנצל...\nבחדר המדרגות הוא הכניס לי כזאת בטירה שנשבר לי חלק קטן מהן הקדמית. היא בחסר עד היום.',
    //         name: 'הייתי בת 17',
    //         id: '6',
    //         tags: ['אלימות מילולית', 'קנאה'],
    //     },
    //     {
    //         timestamp: '5/16/2020 18:13:41',
    //         whatTriggeredChange:
    //             'היו שתי נקודות מפנה1.היינו אצל חברים שלו שהבחור הציע לבחורה נישואים ושאלו אותנו, איך הצעת? הוא אמר הייתי שיכור והתקשרתי להציע לה ובבוקר גיליתי שאני מאורס וככה התחתנו, חוותי השפלה כל כך חזקה ומשם לקחו עוד כמה שנים אבל התחיל תהליך, 2.התחלנו ללכת לטיפול, כדי לעזור לי להשתנות להגדרתו ואחרי שנה שהיא לא ידעה איך לעזור לנו היא המליצה לנסות לעשות הפסקה ומשם פרחתי..לקחו עוד שנתיים עד לגירושין ',
    //         howDidYouManged:
    //             'נסגרתי, עשנתי המון גראס, שנאתי את עצמי, הייתי בוכה המון,מתוסכלת מעצמי בעיקר..',
    //         additionalnfo:
    //             'אם את חוזרת הביתה וזה כמו שדה קרב מנטלי תבדקי מה קורה. אם את מתבקשת לא לדבר על זה תבדקי..אפילו תתחילי מגוגל.',
    //         image: '',
    //         mail: 'Shaniazaria17@gmail.com',
    //         whatHelpedYou:
    //             'לימודי ימימה, מדיטציות, חברים טובים שפגשתי בדרך, משפחה, גוגל על התעללות במערכת יחסים- לראות שלמה שאני עוברת יש שם וזה לא בראש שלי.תפילה ושיחות עם אלוהים. ',
    //         background:
    //             'לפני 6 שנים התגרשנו והיינו יחד 9 שנים מגיל 24 עד 34 בערך',
    //         storyContent:
    //             'הייתי בת 24, מוצלחת, אבל חסרת ביטחון, אחרי אירוע שבו קצרתי הרבה מחמאות על העבודה שלי, בדרך הביתה הוא אמר: אני ואת יודעים שזה סתם, זה הכל בולשיט...והרגשתי שהוא מכיר אותי. ב9 שנים שהיינו יחד, הוא דאג לומר לי שאני אדם חסר אחריות שאי אפשר לסמוך עליו שאני מפונקת וצריכה להתבגר.\nלא אהבתי את העבודה שלי והוא במשך שנים היה אומר לי שכבר נכשלתי במה שבאמת רציתי ושאין לי טעם להחליף כי לא אמצא משהו יותר טוב.\nהיה משכנע אותי שאני לא עושה כלום ושאני לא מרוויחה כסף ולכן לא מגיע לי להוציא כסף, בזמן שהוא הולך למכון כושר ולבריכה לי היה אסור ללמוד או להתאמן.\nמבקש שלא אדבר עם חברים או משפחה על הבעיות שלנו כי הוא מרגיש חשוף וששופטים אותו.\nביקש ממני לא לדבר בציבור כי אני מביכה ואי אפשר לדעת מה אני אגיד..\nכשמבלים עם חברים לא אהב שאני צוחקת...זה הביך אותו, אם הייתי צוחקת יותר מידי היה מעניש אותי ומתרחק ממני כשמגיעים הביתה.\nאיים שיתגרש ממני המון פעמים, למעשה מיד אחרי שהתגרשנו התחיל לאיים עליי.\nהיה אומר לי "בצחוק" שאני השפחה שלו ושאצא מהבית רק עם בוראכא.\nאם לא הייתי רוצה לשכב איתו היה מעניש אותי ולא מדבר איתי.\n',
    //         name: ' שרון',
    //         id: '7',
    //         tags: ['אלימות מילולית', 'קנאה'],
    //     },
    //     {
    //         timestamp: '5/16/2020 19:54:15',
    //         whatTriggeredChange:
    //             'היא לא השתנתה ברגע. תהליך העזיבה לקח כשנה וחצי של הבשלה, עליות, מורדות והמון פחד. ובסופו, ברחתי מהבית.',
    //         howDidYouManged:
    //             'במשך שנים האשמתי את עצמי. למרות שגדלתי בבית אוהב ולמרות שידעתי שלא "מגיע" לאף אחד, הוא שכנע אותי כל הזמן שאני זאת שמוציאה את זה ממנו.',
    //         additionalnfo:
    //             'לא לחכות שדברים ישתנו מעצמם. לא להישאר בשביל הילדים, לעזוב בשביל הילדים. לזכור שגם אם זה קשה ומורכב, אפשר לצאת משם. ליידע מישהו במצב, לתכנן את העזיבה ולצאת מהבית כשהוא\\היא לא נמצאים. לזכור שהאוויר שבחוץ שווה את זה.',
    //         image: '',
    //         mail: '',
    //         whatHelpedYou:
    //             'משפחה מדהימה, חזקה, מכילה ותומכת, ומעגל חברות מדהים שלא עזב למרות הנתק שנכפה עליי.',
    //         background: '6 שנים (מגיל 18), מתוכן 3 כזוג נשוי. ',
    //         storyContent:
    //             'הייתי שם.\n\nזה מתחיל מהר. וחזק. זה אינטנסיבי בצורה ששום קשר אחר לא יכול להיות. זה שואב אותך בכל פעם עוד יותר עמוק. לכל אחד מאיתנו יש נקודות כניסה. אלו שיודעים איך לזהות אותן, נכנסים. ומהרגע שהם נכנסו נדמה שאי אפשר לעצור אותם. יש להם גישה להכל.\nהם האקרים של נשמות. \n\nלא רואים עליו. הם לא מסתובבים עם קרניים וקילשון. הוא מרשים, הוא אקטיביסט, הוא אינטיליגנט, הוא סוחף את כל הסביבה שלו. הוא חד, וחריף, ורהוט. הוא בטוח בעצמו. ומסיבה שלא לגמרי ברורה לך, הוא גם בטוח בך. והוא מרים אותך.\n\nזה מתחיל בלי ששמים לב. פתאום את מסתובבת עם הרגשה מעומעמת שאת כל הזמן לא בסדר. את כל הזמן פוגעת. את משאירה אותו לבד ויוצאת עם חברות. את מתעסקת בתחביבים או בעבודה שלך במקום להיות איתו. \nוהוא זקוק לך כמו אוויר לנשימה, כי רק את מבינה אותו. \nולאט לאט את מתנתקת. את מרוחקת. אנשים לא מבינים מה עובר עלייך. את לא מבינה מה עובר עלייך. \nגם אם פיזית את שם, תמיד רץ לך ברקע איזה משהו שאומר לך שאת והם כבר לא באמת חיים באותו העולם. העולם שלך מורכב ממנו וממך. ולפעמים קצת מעקצץ איזה משהו שאומר לך שהעולם שלך בעצם מורכב רק ממנו.\n\nוהכל טוטאלי. הכל ביחד. הוא יודע בכל שניה איפה את. עם מי את. על מה את חושבת. מה אמרת לחברה שלך בטלפון. מה היא ענתה. מה ענית לה בחזרה. מה אכלת לארוחת בוקר. כמה נשימות נשמת אתמול.\nנדמה לך שפעם כשנשמת נכנס קצת יותר אוויר לריאות. \n\nוזה יוצא ממנו בהדרגה. בהתחלה זה מבט. מבט כזה שמקפיא את העצמות. מבט שגורם לכל שניה להרגיש כמו שעה. ולאט לאט הכל יוצא, אבל יוצא רק כשהדלת סגורה. \nהוא יפרק לך את הגוף והנשמה בכאב שלא דמיינת שקיים, מבפנים ומבחוץ, ולא ישאיר שום זכר למה שהיית פעם. לפעמים בשליטה, ולפעמים משתחרר ממנו משהו כל כך נורא שאת לא מצליחה להאמין שקיים. \nלפעמים את מנסה לדבר. להסביר. לפעמים את מתנצלת. לפעמים את מתנתקת. לפעמים את פשוט שם, מחכה שזה יגמר. \n\nהוא גורם לך לחשוב שאת נוראית. את פגומה. את משוגעת. את חסרת כל ערך. את צריכה בכלל להגיד לו תודה שהוא מוכן להישאר איתך. מי בכלל יקח אותך?\nוהוא אומר שהוא אוהב אותך כמו שאף אחד לא יאהב אותך בחיים שלך. למרות הכל. הוא אומר לך שהוא לא יכול לחיות בלעדייך.\nאת פשוט לא שומעת שמתחת לזה הוא אומר שאולי הוא לא יתן לך לחיות בלעדיו.\n\nובשלב כלשהו, את כבר לא את. את כבויה. את על אוטומט. את במצב הישרדות. את לא יכולה ללכת. הוא יהרוג אותך. או יתאבד. או ידאג שלא תראי יותר את הילדים שלך בחיים. ובינינו, את גם ככה לא ממש יודעת מי את בלעדיו.\nלא מעניין אותך מה יהיה בעוד שנה מהיום. לא מעניין אותך מה יהיה בעוד שבוע. את בסך הכל רוצה להגיע למחר בבוקר. עוד שבוע זה לפריווילגים. לפעמים את בסך הכל רוצה לצלוח את השעה הקרובה בחתיכה אחת.\n\nואף אחד לא יודע. אתם לא הטייפקאסט. והוא אומר לך שזה אתם מול כל העולם. ואת בטוחה שאף אחד לא יבין אותך. אף אחד לא באמת יצליח להבין למה את שם, או מה יש ביניכם וכמה שזה מורכב. אלה שבחוץ? את מרגישה שמבחינתם את מטבע לשון. את לוקה ב"תסמונת". אבל שתינו יודעות שהחיים קצת יותר מורכבים מזה.\n\nאין איזו נקודת הארה. לא יקרה משהו ופתאום הכל יתהפך ברגע. אף אחד אחר לא יבוא ויושיע אותך.\nזה תהליך. לפעמים הוא קצר, לפעמים הוא איטי ומדורג. לפעמים יש בו נסיגות. \nזה כנראה הדבר הכי מפחיד וקשה שתעשי אי פעם, אבל את יודעת שאת צריכה לעשות את זה.\nאולי אפילו תספרי את זה למישהו, ותצפי שהעולם יפסיק לרגע להסתובב על צירו ומישהו יושיט לך יד ויציל אותך מהטביעה הזאת. \nאולי זה באמת יקרה. אבל לפעמים את צריכה לשחות את זה לבד. \n\nיש איזה חוף שם בקצה. החול שלו לא בדיוק ורוד, אבל אפשר לעמוד עליו ולנשום. ואחרי כמה זמן אפשר גם לחייך ולצחוק שוב. \nועל החוף הזה יש עוד אנשים. כמוני. כמוך. לא רואים עלינו. אבל אנחנו שם, ואנחנו איתך. \n\nהיינו שם.',
    //         name: "ש'",
    //         id: '8',
    //         tags: ['אלימות מילולית', 'קנאה'],
    //     },
    //     {
    //         timestamp: '5/16/2020 22:40:30',
    //         whatTriggeredChange:
    //             'נפרדתי סופית אחרי שחזרתי מחול, בבית שלי, אחרי עוד התקף זעם בלתי מוסבר שלו.',
    //         howDidYouManged: 'חייתי בתוך סיפורים שאצלי בראש, לא התקדמתי .',
    //         additionalnfo:
    //             'זה לא נורמלי שמשפילים אותך לא בקטנה ולא בגדולה. שתפי חברים קרובים המה שאת עוברת גם לא כל כך קרובים. תבקשי עזרה במפורש במרומז בכל דרך. תמצאי רשת תומכת מערכת, חברים ועוד שישמרו עלייך ולא יתנו לכם לחזור להיות ביחד. אל תפחדי להתרחק - לעבור בית עיר לא להיות קרובה. ואל תשתקי. ',
    //         image: '',
    //         mail: 'aaadan.2008@gmail.com',
    //         whatHelpedYou:
    //             'חברים שביקשתי להיות בקרבתים ששמרו עלי ולא נתנו לי לחזור אליו שוב. ',
    //         background:
    //             'הייתי סטודנטית בת 24, בעיר רחוקה מהבית. חברים שידחו בינינו. מערכת יחסים שנמשכה 3 שנים. ',
    //         storyContent:
    //             'היכרתי את הבחור דרך חברים. אחרי שבוע הרגשתי משהו לא מסתדר לי. וביקשתי להיפרד. זו היתה הפעם הראשונה מ6 או 7 פעמים בהם ביקשתי להפסיק את הקשר. פעם ראשונה היתה הכי תמימה ופשוטה. שבועיים אחרי אחרי לא מעט אלכוהול התקשרתי והוא בא. \nהוא שידר קסם, לכאורה הכי לטובתי ובעדי, היו מילים כמו אהבה באויר. חגים מועדים העברתי איתו ומשפחתו. משפחה חמה ואוהבת ומחבקת . הוא היה גר בבית הוריו.\nהבחור חשוב שהוא יותר חכם ממני וכל פעם השפיל אותי, שאני טיפשה ולא מבינה (הרהרתי ביכולתיי, למרות שהיתי בעיצומו של תואר ראשון והוא לא השלים בגרות). \nהסקס היה קשוח על גבול האלים. \nהתקפי זעם ליוו את מערכת יחסים שלנו לא מעט. \nלא פעם אחרי צרחות שלו מצאתי את העצמי באמצע הלילה חוזרת לדירה שלי עם הציוד ברגל. \nלא פעם מצאתי את עצמי אחרי הצרחות שלו בוחה ביחד עם אמא שלו במטבח. \nכל פעם היה תירוץ אחר בגללו חזרתי אליו.  כמו מגנט ולא ברור עד הסוף למה חזרתי אליו\nאחרי לימודים נסעתי לטיול בחול של כמה חודשים. שיחות כמעט יום יומיות איתו, מלא קנאה והאשמה ואי נוחות שלי. כשחזרתי ביקשתי לא לבוא לבית שלו וביקשתי שיבוא לבית של ההורים שלי במרכז. עוד התפרצות אחת שלו. וגירשתי אותו. \nהבנתי שאם אני חוזרת אליו לא יהיה לי לאן לברוח שוב, אשאב למערכת יחסים פוגעת הורסת, דורסת שלא תתן לי מקום להתקדם. ותיגמר באלימות פיזית מעבר לאלימות שספגתי. \nהיה חסר לי, שם רחוק מהבית את החברים שישמרו עלי ולא יתנו לי לצאת ולחזור שוב ושוב לאותו הבחור. \n',
    //         name: 'אנונימית ',
    //         id: '9',
    //         tags: ['אלימות מילולית', 'קנאה'],
    //     },
    //     {
    //         timestamp: '5/16/2020 23:53:04',
    //         whatTriggeredChange:
    //             'רק צו בית המשפט הצליח לשים חוצץ בינינו. היו רגעים לפני שחשבתי שאפשר לעזור לו ולשנות.. ושהכל יכול להסתדר ',
    //         howDidYouManged:
    //             'במהלך התקופה שהיינו יחד הלכתי לפגישות עם מי שנפגשתי וייעצה לי בשנים האלה. היא ידעה מה קורה ובתמיכתה עשיתי את כל המהלכים הללו. גם הורי ידעו מעט, בת דודתי ידעה מה קורה ובשלב כלשהו פניתי לבן משפחה עורך דין שימליץ לי מה לעשות',
    //         additionalnfo:
    //             'לשתף במה שקורה לך לפחות אדם אחד שאת סומכת עליו ושמי שנמצא בסביבה שלך לא יקל בזאת ראש. והאהבה שנובעת מתוכך ראויה רק לבן זוג אוהב ומכבד ורק לאותה האהבה שאת מעניקה .',
    //         image: '',
    //         mail: 'S_k_10@ymail.com',
    //         whatHelpedYou:
    //             'רק התמיכה של מי שהיה סביבי. עזר לי שאמרו לי שוב ושוב שהאופן שבו פעלתי היה הכי נכון.',
    //         background:
    //             'זו היתה מערכת יחסים זוגית, קצרה, ארכה כארבעה חודשים. הייתי בת 27.',
    //         storyContent:
    //             'הכרנו, הוא היה אח של חברה מבית הספר שכבר שנים לא היינו בקשר. התקרבנו, ואז הבנתי שהוא בודק את הנייד שלי ואת המיילים שלי מהנייד, הוא הגיע למייל שקיבלתי מבחור שנה לפני כן. התחיל לחקור אותי לגביו. מצאתי את עצמי הולכת ברחוב כשפניי מביטות בקרקע ולא מעיזות להסתכל לצדדים שמא אביט בטעות על בחור והוא ישים לב. במקרה אחר הוא הציץ לתוך חדרי שהיה בקומת קרקע, כדי לוודא שאני לא נמצאת עם מישהו, זה היה בלילה והוא לא ראה שראיתי אותו. מאוד מלחיץ. מה שהביא לסיומו של הקשר היה מקרה בו נפגשנו מחוץ לדירה שלי בערב והוא שאל אם אני אוהבת אותו איזה עשר פעמים, לא הייתי מסוגלת לומר שלא אבל גם לא הייתי מסוגלת לומר שכן (זו היתה תקופה, אמנם לא ארוכה אבל היו עוד מקרים שהוא יצא משליטה, לא פגע בי פיזית אבל הייתי נתונה להמון לחץ בעקבות התנהגותו ובאמת הרגשתי שאני לא רוצה שנהיה יחד ורק הייתי צריכה לחשוב על הרגע הנכון, כי ידעתי שלא כדאי שאעשה זאת כשנהיה פיזית יחד) החלטתי ללכת להוריי שגרו לא רחוק, נפרדו דרכנו, מדי פעם הסתכלתי לאחור כי חששתי שהוא עוקב אחרי אך לא ראיתי אותו והתקשרתי לאמא שלי, לפטפט איתה בדרכי אליהם, כדי שארגיש שאני לא לבד..  ברגע שהתחלתי לדבר איתה הוא פתאום הגיח משום מקום ותפס את הנייד עם מבט מאוד מטריד ומלחיץ. הוא ראה שזו אמא שלי בשיחה ולקחתי את הנייד מידיו וסיימתי את השיחה עם אמא שלי, לא אמרתי לה כלום. הוא ליווה אותי אליהם, חששתי, אך אני זו שהצעתי שילווה אותי אליהם כי לא היה לי ממש מה לעשות, רציתי להרגיע אותו והיינו ברחוב די לבד, אזור שקט.  לאחר מכן דיברנו בטלפון וביקשתי שלא נפגש.. הוא שלח עשרות הודעות וטלפן הרבה, בחלק מהפעמים ממש דיברנו על ההתנהגות שלו והיה בי הרצון לעזור לו להתגבר על המקום הזה.. התייעצתי עם בת דודתי שהיתה עובדת סוציאלית בתחילת דרכה והחלטתי שהדבר הנכון הוא, לגשת לשירותי הרווחה יחד איתו , כי הוא אמר לי שהוא רוצה שנעשה את זה ביחד, שנעזור לו להתגבר על המצב שלו ביחד. קבענו באחד הבקרים וטעיתי במיקום של השירות הסוציאלי, לכן יצא שנפגשנו במקום מעט מרוחק ושם כבר חששתי שנלך ברחובות היחסית ריקים עם הלחץ שאחז בו וגם בי ובאמת רגע לפני שנכנסנו, הוא פגע בי בכח עם בקבוק מים שהחזיק, לא זרק אותו עלי אלא ממש הכה בי ופגע לי בעין. מישהו שעבר ברחוב קלט שקרה משהו ונכנסנו, התחלנו להסביר את הכל לעובדות הסוציאליות והוא נשאר איתן בחדר וביקשו ממני שאלך משם. בהמשך הלכתי למשטרה ומלאתי דו״ח שאיתו הלכתי לבית המשפט ושם קבעו שיהיה צו הרחקה, לא הגשתי תלונה במשטרה ולאחר מכן הוא נלקח למרכז פסיכיאטרי מוכר, כנראה שהיה לו עבר שם.. אחיו התקשר אלי וביקש שלא אספר להם שהוא תקף אותי וכך היה, התקשרה אלי פסיכיאטרית מהמרכז ושאלה אם היתה אלימות פיזית מצידו, התמהמתי בכוונה כדי שאולי היא תבין לבד.. אך לא הייתי מסוגלת לומר לה. ',
    //         name: 'אנונימי',
    //         id: '10',
    //         tags: ['אלימות מילולית', 'קנאה'],
    //     },
    //     {
    //         timestamp: '5/17/2020 0:10:43',
    //         whatTriggeredChange:
    //             'הוא קילל אותי ממש וזה פשוט הכה בי שאני לא בזוגיות שראויה לי. הפרידה לקחה איזה יומיים והסיום שלה הוא כשאני מכווצת על המיטה, הוא צורח וזורק דברים מהחלון, צועק עליי שאני מפלצת ואין לי לב ושאני מדהימה ומהממת ואני לא יכולה לוותר עלינו ככה. ושאני זונה, ושגלגל מסתובב..בסוף הבין שהפעם לא אחזור בי והלך ואני כמו מנטרה הזכרתי לעצמי שאני לא מפלצת ויש לי לב',
    //         howDidYouManged:
    //             'בהתחלה ממש לקחתי על עצמי. שאני לא בסדר, לא יודעת, לא מבינה. כל דבר נראה לי קטן ולא משמעותי. זה גם לא היה נורא ואלים בטירוף, אבל כשנגמר הרגשתי שיצאתי מהכלא',
    //         additionalnfo:
    //             'לא בכל מחיר. אם את יודעת שרע לך ושלקחו לך את החיים אולי זה לא המקום בשבילך. ושהוא לא באמת היחיד שיוכל לאהוב אותך ככה. שזוגיות זה לא בכל מחיר ויש גם גברים באמת נפלאים שיתנו לך להיות',
    //         image: '',
    //         mail: '',
    //         whatHelpedYou:
    //             'האמת, ההסלמה במצב והקללות המפורשות. והידיעה שאני ראויה ליותר וזה שהלימודים התקרבו לסיומם וידעתי שלא אצטרך לראות אותו כל יום. מה לא עזר? אף אחד מסביב. משפחה, חברים..בהתחלה קצת כעסתי אבל אחכ הבנתי שלא ידעו ושלרוב אנשים מרגישים שלא מתאים להתערב לאחרים בזוגיות ושזה לא ממש משהו שמישהו חשב שיקרה לי',
    //         background:
    //             'חצי שנה, בגיל 24, אחרי שמאז התיכון נמנעתי מלכבול את עצמי לזוגיות מסודרת והחלטתי שאולי הגיע הזמן "להכנס לתלם" וללמוד להיות בת זוג רשמית של מישהו. היינו זוג ידוע, פגשנו חברים ומשפחות והכל. הוא גר עם ההורים באותה תקופה אז רוב הזמן די גר אצלי',
    //         storyContent:
    //             'הכרנו בלימודים. תוך שנייה נהיינו זוג, התחברתי לזה שהיה שונה, שמרד בגורל שלו להיות עבריין ובחר בחיים של אומנות. זה גרם לי להעריך אותו. מהתחלה כעס שאני לא עונה ולא מתקשרת מספיק בפלאפון, והבנתי שאני לא יודעת איך להיות בת זוג ומסכן שהוא צריך להיות האחד שאני לומדת עליו. לאט לאט הפסקתי לפגוש את חברים שלי כי כל פעם זה גרר ריב מטורף, כי הם בנים, כי הם מעשנים, כי זה לא שהוא לא לא סומך עליי אלא לא סומך עליהם. הבנתי שהגוף שלי לא מושלם בעיניו כי יש לי תחת והוא אוהב שטוחות. הפסקתי לדבר עם כל אחד שהיה לי איזשהי אינטרקציה מינית איתו בעבר, גם אם היינו חברים. הייתי מודעת לזה שכל שיחה בוואצאפ או בפייסבוק תעבור כנראה תחת עיניו באלגנטיות. למדתי על פורנו. למדתי לקבל את זה שכל פעם שהוא גומר הוא הולך לצרוח ולהרביץ לקיר כאילו הוא בסרט. הייתי מחכה שייגמר ונרדמת. למדתי שיש עולם שבו כולם בוגדים בכולם ולא משנה מה, הוא לא מאמין לי שמבחינתי זה לא אופציה בכלל. למדתי שהעבר שלי הוא טעות, הוא זנות, ושעדיף לא לדבר על זה שאני אוהבת מסיבות ויצא לי לשכב עם עוד כמה אנשים לפניו. למדתי שאסור לי להתקלח בלעדיו, שאסור לי להיות עם שיער גוף, ושאסור לי לגלח לידו (אז..איך? איפה..? מה?!) למדתי שגם כשהוא בשירותים ויש לי רגע הפסקה ממנו אני צריכה לשחק איתו משחקי אונליין בפלאפון. שאם אני מתכתבת עם עוד מישהו באותו זמן שאני מתכתבת איתו אסור שידע. שבכללי עדיף שלא אתכתב עם אחרים. להסתגר בשירותים כדי שיהיה לי רגע פרטיות. שללכת לבד למקומות זה כבר לא. גם כשהוא בחו"ל. להעמיד פנים שאכפת לי שמדבר עם האקסית כי אם לא אז מבחינתו לא אכפת לי ממנו. שאסור לי להסתפר בלי שיסכים (נראלך אני לא מרשה לך להסתפר?! רק קשה לי שאת לא מספרת כלום. את לא יודעת לתקשר) \nלא למדתי- להתעקש בכמה פעמים שעזבתי והוא התחנן ובכה שהעולם ריק בלעדיי ושיהיה לי קשה לבד, וחזרתי. לא למדתי שלא תמיד צריך שניים לריב, לפעמים יש אחד שלא יכול בלי ולפעמים מותר לי לא לקחת על זה אחריות. לא למדתי שלוותר על מפגש אחד עם חברים ועוד אחד זה כן ביג דיל כי זה אף פעם לא נגמר בשניים. \nהייתה פעם שרבנו ברחוב. אישה אחת תפסה אותי רגע לבד ושאלה אותי אם אני צריכה עזרה. הרגעתי אותה שהוא לא אלים ורק קצת צועק, (באמת לא הייתה אלימות פיזית). אבל אחכ תהיתי איך לעזאזל זה נראה מבחוץ',
    //         name: 'אנונימית',
    //         id: '11',
    //         tags: ['אלימות מילולית', 'קנאה'],
    //     },
    //     {
    //         timestamp: '5/17/2020 0:22:05',
    //         whatTriggeredChange:
    //             'שיתפתי את אחותי והיא נצמדה אליי כמו שומר ראש וכל פעם שהוא רק התקרב פיזית כדי לדבר איתי גם שהתחנן וכמעט התפתיתי אחותי תפסה אותי ביד פיזית משכה אותי או נעמדה לפניי כחוצץ או מגן ואיימה שאם לא ילך או יפסיק להתקשר היא תזמין לו משטרה שוב ושוב עד שנעלם',
    //         howDidYouManged:
    //             'ניסיתי לרצות אותו מרבית הזמן, התחלתי להאמין שאני נוראה ושזה באשמתי כנראה עד ששיתפתי חברות ואת אחותי',
    //         additionalnfo:
    //             'שתפו משפחה חברים קרובים לא להישאר עם זה לבד. לצערי לא ממליצה לפנות לרשיות רובן סיימו כגופות ו"מוכרות לרווחה" שגם שאישה מוצאת אומץ לברוח עם הילדים בסוף זה בעוכריה כי פתאום היא לא אמא טובה ובמקום להוציא את הפוגע הן נכלאות במקלט או לחלופין קורעים מהאם את הילדים לפנימיות מזעזע טראומה לא מתקנים בטראומה. ומעבר לכך גישת הניכור ההורי המצוצה מהאצבע שבדיוק במקום הזה נשים יואשמות רק כי מנסות להגן על ילדיהן מאדם אלים מינית ואו פיזית ושם הנשים חוות שוב ושוב אלימות משפטית בושה למדינה ',
    //         image: '',
    //         mail: '',
    //         whatHelpedYou:
    //             'כתיבת יומן עם חצאי אמת שרק אני אבין מחשש שיראה. ואחותי המדהימה שסיכנה את עצמה מולו שהגנה עליי.',
    //         background:
    //             'רקע, סוף שנות ה90 גיל 16 חבר ראשון שלי אני תלמידה והוא חייל גדול ממני ב3 שנים יוצאים שנה וחצי. אני גדלתי בבית ללא אלימות, עם זוג הורים אוהב שעד היום נשואים, בבית היו גבולות ברורים, בית נורמטיבי.\nהוא גדל בבית אלים מגיל 0, הוריו נפרדו שהאם הגיעה לפסיכיאטרי והאב קיבל משמורת עליו שהיה בן 3 ועל אחיו התינוק. הסבתא אם האב סייעה בגידולם.',
    //         storyContent:
    //             'בהתחלה הוא היה מלאך ו"גבר" מול כל מי שהכיר ומכיר אותו. לאחר חצי שנה של יחד והכל ממש טוב עם קנאה קלה שהחמיאה לי, שכבנו לראשונה היה הראשון שלי די מהר הפך אדם אחר אובססיבי, התקפי זעם וקנאה, שתלטן הרחיק אותי מחברות ןמהמשפחה. היה נועל אותי בחדרו, ואז החלו הקללות וההשפלות היה ממציא סיטואציות ולמה ההוא הסתכל עלייך??!! כך החל. בוכה מצטער מפצה\n ואז כמדרון חלקלק די מהר הגיעו המכות.. לפני שהן הגיעו נכנסתי ממנו להריון..עברתי הפסקת הריון בשבוע 16.. ומרגע ההריון משם הכל הסלים יותר. כאילו יש לו עליי בעלות.\nמכות שלא אשכח בזמן ההריון.. משיכות שיער, חניקות, סטירות, בעיטות מבט של טורף/רוצח בעיניים.שיניים חורקות היצמדות לפנים שלי מטווח 0. בהמשך הגיעו הבעיטות הנשיכות, המעקבים, כל פעם הוא שידרג..\nבעיקר את המכות השקטות..- הצביטה ברגל מתחת לשולחן שבת, הדחיפת אצבע חזקה לצלעות שוב ושוב ושוב ואבוי אם תשמיעי הגה זה רק יחמיר. עזבתי היה מפחיד וקשה כי רק בכדי שילך הייתי צריכה לרצות אותו ולומר שאני סולחת  ואוהבת🤮ושוב אובססיבי ושרציתי לסיים החל להתחנן לעקוב יותר לבכות ובאותה נשימה לקלל אותי בכל הקללות לאיים שיהרוס לי את החיים שיוציא לי שם של זולה(ואני לא משתמשת במילים הבוטות שלו) ושוב קללות שלא שמעתי מעולם ברחוב..\nשוב בוכה מתחנן כותב לי מכתב אהבה, החלטנו להישאר ידידים, תמימות של נערה, הוא החליט שכנראה השפלתי אותו והצגתי אותו ואת מכתבו ללעג עם חברות.. מכות, הצלחתי לברוח מהבית..חוצה כבישים בטרוף כמעט נדרסת ןהוא באמוק אחריי.. רצה אני מגיעה כ150 מ מתחנת המשטרה. הוא מצליח להשיג אותי תופס אותי מאחור בשיער וגורר אותי מהשיער ברחוב מיותר לומר שאף אחד לא מתערב..הוא מצליח להושיב אותי לשיחה צמודה.. מוציא אולר וחותך אותי בירך.. אמרתי כל מה שרק יכולתי לומר רק כדי שהמצב לא יסלים והוא ירגע "ויבין שאני אוהבת אותו" הוא נרגע',
    //         name: 'אדרת פרטוש',
    //         id: '12',
    //         tags: ['אלימות מילולית', 'קנאה'],
    //     },
    //     {
    //         timestamp: '5/17/2020 0:35:15',
    //         whatTriggeredChange:
    //             'זכיתי לחופש שלי. לדבר עם חברות. לבהות בנייד שלי כמה שבא לי וגם לקחת אותו לשירותים אם בא לי. לא חוויתי אלימות פיזית, אבל אלימות כלכלית ומילולית. זריעת פחד. ',
    //         howDidYouManged:
    //             'כעבור שלוש שנים סהכ מיום שניפגשנו, עזבתי את הבית שלו ולקחתי את הילדים איתי. ',
    //         additionalnfo:
    //             'לקום ולפרק זה הכי קל. ככה אומרים. זה לא הכי קל! זה הכי מפחיד שיש! איך אסתדר? כלכלית? עם שני תינוקות? איך אספיק לבשל? לארגן? לנקות? מתי כבר אשן לילה רצוף? קומי! קומי ותצילי את עצמך ואת החיים שלך ושל הילדים שלך! תמיד תשאירי לך חברה אחת שאת משתפת אותה בהכל. שתהיה לך שמירה קרובה. כתף להישען עליה. את חזקה. זה אפשרי. ',
    //         image: '',
    //         mail: '',
    //         whatHelpedYou:
    //             'אני לעצמי. אף אחד לא תמך בי. מעט חברות שעוד נשארו על הקצה, עזרו לי במעבר הדירה, אבל מעבר לזה כלום. אני לעצמי ולילדים שלי. הגשתי תביעות בעצמי לטובת מזונות ילדים והסדרי ראיה. אני מגדלת את ילדיי לבד כבר שנתיים. הם בני 3+4',
    //         background:
    //             'הייתי בת 33, צמאה לזוגיות ומשפחה. פגשתי גבר חסון, פרצוף מאיים מעט, אבל לב של מרגרינה. לאט לאט נחשפו הפנים האמיתיות...',
    //         storyContent:
    //             'זה התחיל בהערות על הלבוש שלי. הערות על הסלולרי שלי, למה הוא נעול עם קוד, הצעתי לו את הקוד, הערות על החברות שלי, יצירת קשר עם החברות שלי, לבדוק אם אני מנהלת רומן מהצד. יצירת קשר עם עובדים שלי, לבדוק למה לא עניתי היום ב12 והאם באמת הייתי בפגישה. נכנסתי להריון מהר מאוד והחשדות שלו לא פסקו. שיניתי את סגנון הלבוש. המעטתי בשהייה עם הנייד בנוכחותו. המעטתי במפגשים חברתיים. עשיתי הכל כדי למנוע ריבים. זכיתי ליחס מזלזל ומשפיל. כשהיינו לבד. ליד המשפחות שלנו התנהג כמו נסיך וכולם חשבו שאני הורמונלית. אמרו לי שאחרי הלידה הוא יישתנה. הוא לא השתנה. מהר מאוד לאחר הלידה הבנתי שאני זקוקה לעוד ילד ויהי מה. אחד זה לא מספיק. נקלטתי להריון שני צמוד מאוד. את רוב השנה העברנו בחדרים נפרדים אבל בשבתות הבית תסס. ברחתי כל שבת עם הילדים. לטייל. לקניונים. רק לא להיות איתו בכלא הזה שהוא יצר לי. ',
    //         name: 'איימי',
    //         id: '13',
    //         tags: ['אלימות מילולית', 'קנאה'],
    //     },
    //     {
    //         timestamp: '5/17/2020 0:57:28',
    //         whatTriggeredChange: '',
    //         howDidYouManged:
    //             'עדיין לא הצלחנו לצאת ממנו, אבל בעזרת השם אנחנו נצליח ואמא תצא מהבית הזה',
    //         additionalnfo:
    //             'לצערי אין תמיכה כמו שצריך עבור אישה מוכה נפשית, צריך לשכור עבורה חדר ולהעביר אותה כי לבד היא לא מסוגלת לעשות את זה. נדרש גם טיפול פסיכולוגי...... אני מתפללת שהמיזם הזה יעזור לנו, אמן, אמן, אמןןןן ותודה על הנסיון לעזור',
    //         image: '',
    //         mail: 'srachela23@walla.co.il',
    //         whatHelpedYou: 'אנחנו עדיין בזה',
    //         background:
    //             'אמא שלי, לאורך יותר משלושים שנה, ועדיין לא מצליחים להתנתק ממנו',
    //         storyContent:
    //             'מה שראיתי ורואה שקורה לאמא שלי. אבא שלי אדם קנאי, עוד לפני החתונה היא ידעה את זה אבל חשבה שהיא לא תיתן לו סיבה לקנא והכל יהיה בסדר. היא התחתנה איתו בגיל 19 וישר נכנסה להריון. היום כבר די מובן לי שהוא רצה ילדים כדי להשאיר אותה תלויה בו ומוחלשת ועסוקה בטיפול בילדים, למרות שעל פניו עשה לדעתי הצגה שהוא אוהב ילדים, אני הבת שלו והרגשתי שאנחנו הילדים היינו בעיקר נטל עליו. הוא אדם עם פתיל קצר, לא מוכן שנחשוב אחרת ממנו, מדבר כאילו הוא האדם הכי ישר ונאור שיש כאשר בפועל המצב בבית שונה לחלוטין. היה עוקב אחרי אמא לעבודה וכשהיא חזרה הוא היה מתשאל אותה כמו בחקירה למה התעקבה בעשר דקות...... והוא היה הולך איתה ברחוב ואומר שגברים אחרים סוטים ותיראי איך הם מסתכלים עלייך. אני חושבת שהמוח שלו מעוות והוא חי את העיוות הזה ובטוח שהוא צודק ושאמא משקרת לו. כשהוא קצת לא מרוצה מאמא הוא נוקט בעונש של מבט מפחיד ולא מדבר איתה, מתעלם מקיומה. לפעמים מספר ימים ולפעמים שבועות, זה כנראה תלוי בראש המעוות שלו. הוא לא מסוגל שנביע דעה שונה משלו, מה שהוא אומר צריך לעשות ישר כמו שהוא אומר ובאותו הרגע. הוא ניסה לדעתי לשלוט נפשית באמא ובנו. הוא אדם ממש חרדתי, בכל סיטואציה הוא ישר מדמיין את התרחיש הגרוע ביותר. אצלו זה מאוד שחור או לבן, אין ממש אמצע או דרך ביניים. הוא מציג עצמו בבית בדיבור שלו כטוב לב, צדיק ושאחרים הם לא בסדר וכאילו שהוא קורבן של התנהגות לא טובה של אנשים רעים אחרים. בפועל הוא אדם שבחוץ משחק אותה ממש נחמד וכולם קינאו באמא שלי ואמרו לה איזה בעל נהדר יש לך, זכית. אבל בפועל בבית הם לא יודעים שהוא שונה מאוד, לא חברותי, כעסן, חסר סבלנות, אני קוראת לזה טרור שקט, מספיק מבט כועס ממנו כדי להתכווץ מבפנים. כשהיינו קטנים הוא ניסה להכות אותנו ואמא עצרה אותו והזהירה אותו. ואז הכעס שלו הגיעה בהתנהגות אגרסיבית ואובססיבית אבל הוא לא הרביץ אבל מצא דרכים משלו לשלוט עלינו נפשית ובראש. \nויש עוד הרבה......',
    //         name: 'אנונימי',
    //         id: '14',
    //         tags: ['אלימות מילולית', 'קנאה'],
    //     },
    //     {
    //         timestamp: '5/17/2020 1:41:36',
    //         whatTriggeredChange:
    //             'אחרי שנתיים שהיינו יחד הבת הבכורה שלו נפטרה. ולא משנה כמה הייתי שם, תמיד הוא עמר שאני לא נוכחת לא נמצאת, לא משקיעה , לא עושה - ראה רק שחור בי, עף פעם לא לבן. ואז הגעתי לעוד שבירה שמעוניינת לסיים את הקשר, הינ שוב הסנריו הקבוע שממנו החלטתי לשים את כל הבייצים באותו סל ולהמר. עשיתי אולטימטום של לגור יחד ושאם זה יעשה לנו טוב - הרווחנו , ואם לא - אז זו תהיה פרידה סופית. אכן עברנו לגור יחד והבתחלה זה עשה טוב ואז אחרי כמה חודשים זה נעשה רע מאוד כולל האלימות הפיזית. בשל הקושי הגדול שלו, הוא ביקש שנפצל חזרה בתים כי היה לו קושי גדול לגור עם ילדי  אבל עם דרישה שאבטיח שאנחנו נשאר ביחד. בקיצור של דבר, אני לא הייתי מסוגלת יותר, ובעצם אמרתי שאנו מפצלים בתים ונפרדים לתמיד. היה לו מאוד קשה לקבל את זה. הוא מאוד הקשה על תהליך האריזה והפיצול אבל זה קרה בסוף',
    //         howDidYouManged:
    //             'לא יכולה לומר שהתמודדתי טוב.. במהלך החמש השנים כל הזמן הייתי אומרת גם לו וגם למטפלת הזןגית שהלכנו אליה שהוא האוהב הכי גדול שלי והאויב הכי גדול שלי.  היו פעמים שהייתי מתחרפנת, היו פעמים שהייתי מכילה, היו פעמים שהייתי אובדת עצות ובעיקר חסרת אונים',
    //         additionalnfo:
    //             'זה בעיקר המודעות העצמית, כי בעיקר לא האמנתי לעצמי שאני בסיטואציה שכזו. ',
    //         image: '',
    //         mail: '',
    //         whatHelpedYou:
    //             'מכיוון שלא שיתפתי אף חברה ממש לאורך כל החמש שנים , הייתי צריכה להתחיל לשתף משם גם היה ברור שהן ראו המון דברים מהצד אבל פחדו לאבד אותי ולכן לא הביעו עמדה. בזכות התמיכה שלהן וההחלטה הברורה שהיה לנגד עיני שנחצה הקו האדום שלי שזה ילדי',
    //         background:
    //             'פרק ב, חמש שנים יחד כולל מגורים, התחיל לא בהבנה שלי שזה מה שקורה, בערך חודשיים מהרגע שהיינו יחד עד הסוף. הצלחתי לסיים את הקשר באוגוסט האחרון , מידי פעם עדיין צריכה להתמודד עם הודעות שלו אבל מצליחה להתמודד. בת 41',
    //         storyContent:
    //             "מערכת יחסים שונה שמעולם לא היתה לי. זה התחיל בהתמכרות להרגשת האהבה האינסופית שלו אלי. הכל היה סופר עוצמת. היתה כימיה פיזית שמעולם לא חוויתי והרצון שלו שכל הזמן נהיה יחד. כבר ממש בהתחלה היו לו כל מיני הערות וכל הזמן \"זמן חינוך\" של למה בפייסבוק, למה בטלפון, מי שולח הודעות והמון הערות. תמיד זה היה הופך לויכוח שאני מתייאשת בסופו ואומרת שמבינה שזה לא יכול לעבוד ושאי אפשר בכל, אנחנו שונים, חושבים, מתנהגים אחרת- זה היה מטריף אותו, הרצון שלי לפרוש וללכת- לא היה מאפשר לי ללכת, חוסם את המעבר לדלת, מחביא לי את התיק, המפתחות וכד'... אם הייתי מספיק החלטית ומצליחה ללכת, היו 80 טלפונים,  מאבא סמסים, היה מסוגל להגיע באמצע הלילה ולדפוק בדלת שעל השכנים שומעים... בפעמים שלא היה מגיע, קרה לי לפחות פעמים שבבוקר 2 גלגלים באוטו מפונצ'רים - ולא הייתי מבקשת את עזרתו אז היה מתעצבן שנעזרתי התיקון הפנצ'רים בגרוש שלי. היתה תקופה שהיה אומר לי דברים שאני הבנתי מהם שהוא קורא את הוואטספים שלי, או יודע בדיוק איפה אני נמצאת )גיליתי בדיעבד שעשה שיתוף למקום שלי דרך הנייד(. היו כל כך הרבה אירועים שקשה לתאר זו כעדות כתובה... אך בשנה האחרונה האלימות הסלימה לפיזית שמצאתי את עצמי בורחת, שהוא בועט בדלת ושובר אותה כדי להגיע אלי, בסטירה שנותן לי. חשוב לציין שכל החמש שנים ניסיתי לעזוב ללא הצלחה, אני מקבילה זו למכור לסמים. אם כשעזבתי הוא היה מאפשר לי ועוזב אותי לנפשי - הייתי מצליחה,  אבל כל פעם שניסיתי לעזוב הוא היה רודף ומשכנע ואז מרעיף אהבה וכל פעם נשברתי מחדש. השיא שבעקבותיו הגעתי לחלטה שאני מצליחה לסיים את הקשר, היה ארוע אלים כאשר ילדי בבית, שהוא שבר לי צלחת ביד מעצבים בעקבות תשובה שעניתי לו. הגדול שלי נאלץ לבוא להיות לצידי כדי שהוא יתרחק. \nזה היה הקש האחרון שבעקבותיו התחלתי לחזק את עצמי במטרה לסיים סופית. הסיום הסופי היה 3 חודשים לאחר ארוע זה.",
    //         name: 'לא הייתם יכולים לדעת שזה קרה גם לי',
    //         id: '15',
    //         tags: ['אלימות מילולית', 'קנאה'],
    //     },
    //     {
    //         timestamp: '5/17/2020 1:56:38',
    //         whatTriggeredChange:
    //             'תהליך הגירושין שינה הכל. התפתחתי והבנתי דברים. הפסקתי להדחיק.    אגב - הוא לא השתנה, ומאפשר לאשתו (שולח אותה?) להתנהג בצורה גועלית לילדינו.',
    //         howDidYouManged:
    //             'במשך 15 שנה לא התמודדתי. בכיתי המון, והדחקתי. בעיקר הדחקתי. עשיתי הכל כדי שהבית יהיה רגוע.',
    //         additionalnfo:
    //             'לכו לטיפול. זה יעזור להבין מה משמעותו של הקושי ואיך אתם רוצות להתמודד איתו.   שימו לב לנורות מהבהבות: כשבן הזוג משקר לאחרים או מזלזל בהם - מתישהו זה יגיע גם אלייך. כשהוא מעניש אתכם, אפילו בצחוק. כשהתקשורת דועכת. ותמצאו זמן לחיזוק הזוגיות! לכו לטיפול גם אם אתם "רק" לא מוצאים זמן כזה.. ',
    //         image: '',
    //         mail: '',
    //         whatHelpedYou:
    //             'טיפול. חשבתי שאני הולכת לטפל בעצמי כדי לשמר את הזוגיות, והבנתי שעדיף לי ללכת.',
    //         background:
    //             'הכרנו כשהייתי בת 21, חשבתי שזאת מערכת יחסים רגילה עם עליות ומורדות, התחתנו אחרי 3 שנים. גיליתי שאני מתנהגת כאשה מוכה רק בדיעבד, כשכבר היינו בתהליך גירושין. ',
    //         storyContent:
    //             'הכל התחיל מכך שהייתי בהלם מהפגנת קנאה יוצאת דופן, כשהוא "יצא עלי" (מילולית בלבד) כשסיפרתי לו בהתרגשות שפגשתי את האקס שלי מלפני כ18 שנה.\nהסברתי, חזרתי והסברתי. הוא לא הקשיב. רק האשים אותי בבגידה ואמר שיחשוב מה לעשות עם זה.\nהוא יצא בטריקת דלת, אני בכיתי במשך שבוע (כמובן במקביל לעבודה ולטיפול בילדים).\n\nלא הבנתי מאיפה זה בא.\n\nלאחר כ3 חודשים גיליתי שהוא בוגד בי.\nהצעתי שנלך לטיפול אבל הוא סירב.\nהלכתי לבד.\nבמהלך הטיפול עלו באוב זכרונות שהדחקתי:\nשבעקבות ריבים נהג לשתוק, לפעמים גם חודש, \nשהשאיר אותי בבית החולים לאחר לידת בתנו, נסע להוריו ולא יצר קשר (וגם לא ענה) במשך 3 ימים, עד שבא לקחת אותי הביתה,\nשתמיד העדיף שאסע לבד עם הילדים להורי, "כי אני לא מסתדר עם המשפחה שלך. הם לא נחמדים אלי", ואני כמובן הסברתי שהם כן, ודאגתי להגיד להם שישימו לב וכו🤦\u200d♀️  וכשכבר היה מצטרף - תמיד היה מרוחק, שותק, ישן יצא לעשן...\nבמשפחתי תמיד התעניינו ודאגו אם הכל בסדר, ואני תמיד אמרתי שכן, למרות שבלב ידעתי שלא.\nהיום אני יודעת שניהלנו בית שותק שבו לא מדברים כמעט על שום דבר מהותי (לדוגמה - מדהים ומזעזע בעיני, שרק עם בן הזוג הנוכחי למדתי לדבר על הילדים...)\nכשהעזתי לכעוס הוא היה טורק דלת ונעלם, \nכשמשהו לא היה מסודר לשביעות רצונו הוא היה מסנן אמירות מזלזלות כמו "מה עשית כל היום", \nגם כשעבדתי במשרה מלאה (רוב הזמן).\nלילדים הוא היה אומר מילה ומיד הם עשו מה שביקש. אז גם היתה לו סיבה לרדת על צורת החינוך הפתוחה והרגועה שלי, כי באופיי אני הבנאדם הכי מכיל ומבין ובעיקר מכבד אחרים. גם ילדים.\nרק אחרי שהוא עזב את הבית הבנתי שנהגתי לצעוק על הילדים "כי תיכף אבא יבוא ומה הוא יראה..." למרות שלרוב לא אמרתי את המשפט הזה, אלא "רק" העברתי ביקורת על מה שלא מסודר וכו\'. \nשנים של טיפול עזרו לי להבין שעשיתי את זה כדי לזכות ממנו למחמאה כלשהי, (לרוב זה לא עזר לי).\nסמכתי עליו לגמרי בהקשר לחשבון הבנק, ולכן בדיעבד התברר שהוא לקח כספים לחשבון פרטי שלו,\nהיה לי כרטיס אשראי משלי, אבל למרות שהיה לנו הרבה כסף - מעולם לא בזבזתי, כי אני שונאת לשוטט בחנויות. אז למשל קיבלתי והעברתי בגדים עם משפחה וחברות, גם עבור עצמי. אבל כשפעם העזתי וקניתי בגד מדהים וקצת יקר יחסית - הוא הגיב בזילזול על הטעם שלי.\nהחזרתי כמובן.\nבכלל היו לו המון הערות על המראה שלי, כי אחרי 4 לידות כבר  לא נראיתי כמו בת 21... והיו לו המון הערות על הבישול שלי, שכדאי שאלמד מאמא שלו (הצלחתי לענות ל............................................................................................עניתי לו שיש לה 40 שנה "פור" עלי) ועוד ועוד.\n\nזה כבר נהיה ארוך מדי, אז רק אספר שאחרי שהתגרשנו הילדים התחילו להגיד לי את המשפטים שלו...\nאמרתי להם - תקשיבו לי היטב: מאבא התגרשתי גם בגלל המילים האלה. ממכם אני לא אתגרש, אבל אם אתם רוצים שיהיה לנו נעים בבית ביחד - דברו איתי אחרת. ובכלל - בעיקרון - אל תסכימו להעביר אלי מסרים מאבא.',
    //         name: 'אנונימי',
    //         id: '16',
    //         tags: ['אלימות מילולית', 'קנאה'],
    //     },
    //     {
    //         timestamp: '5/17/2020 19:00:07',
    //         whatTriggeredChange:
    //             "הוא טען שאני זו שצריכה פסיכולוג אז קיבלתי את עצתו והלכי לקואצ'רית.היא הבהירה לי שהפחד להתגרש צריך לשמור עלי לא לנהל לי את החיים.הבנתי שעלי להתגבר ולצאת לדרך.",
    //         howDidYouManged:
    //             'אני אישה מאד אופטימית אבל אם נשווה את תמונותיייה אז והיום,זה ממש לא אותה אישה.הגוף שלי דיבר במקומי.סבלתי מעצירויות ודימומים קשים.',
    //         additionalnfo:
    //             'שאחרי יום שחור תמיד תזרח השמש.לנו הנשים יש חוכמה ייצרה וחוזק נפשי.תמצאי לך את החברות הטובות שיתמכו בך ותעשי רק מה שאת אוהבת.אני היום בזוגיות שניה כבר 10 שנים ב", מאושרת בחלקי.יש לי ילדים נהדרים ונכדות מקסימות ויש בריאות טובה ואני כיום מתנדבת במכון רקמן בפרוייקט אישה לצידך הנותן אוזן קשבת לנשים בהליכי פרידה.אני עוזרת ומייעצת מניסיוני האישי ככל הניתןעצתי היא לתת הרצאות בבתי ספר לבנות מהם סימני האזהרה מפני גברים אלימים.לא לחשוב בטעות שקנאה מוגזמת היא אהבה כפי שאני חשבתי בטעות 30 שנה.',
    //         image: '',
    //         mail: 'dgntfalk98@gmail.com',
    //         whatHelpedYou:
    //             '\nהחוזר הנפשי שלי, התמיכה הכלכלית של המשפחה והנפשית של החברות,.כמו כן עשיתי דברים שאני אוהבת.כמו לשמוע מוזיקה,לרכב על אופנים,לטייל ברגל,לרקוד ריקודי עם.',
    //         background:
    //             'כלפי חוץ-היינו זוג מושלם:\nבית יפה\n4 ילדים חמודים ובריאים\nמטיילים המון בארץ ובחול\nכסף לא חסר.\nהיינו נשואים 30 שנה\nהכרנו לפני כן 4 שנים\nהיינו בני 22-23 כשנישאנו\nכשהתגרשנו היינו בני 52.\nבערך ב-15 שנים לאחר הנישואים\nהתחילו לעלות בראשי \nמחשבות על גירושים.\nבפועל, אזרתי אומץ רק לאחר 15 שנה נוספות\nלקום וללכת לחיים חדשים.',
    //         storyContent:
    //             'בעלי בגד בי כנראה במשך כל שנות הנישואין.\nאני ידעתי בוודאות רק בעשור האחרון\nשבו כבר היתה לו מאהבת עם ילד.\nהיא היתה גויה לא מהארץ\nוהוא היה נוסע אליה כל סוף חודש\nל-10 ימים.בשבילי היו אלה ימי החופש\nהכי כיפים.הוא לא התקשר-טען שאין לו אינטרנט,\nואני חגגתי בבילויים עם חברות ומשפחה.\nכשרציתי להתגרש, גרר אותי לטיפול זוגי.\nהיכחיש שיש לו יחסים אינטימיים וילד גם לפסיכולוגית.היה מניפולטור.תמיד האשים אותי.\nמאז שנישאנו הוא היה קנאי נוראי.תמיד האשים אותי בבגידות שלא היו ולא נבראו.לכל טלפון שלו הייתי חייבת לענות שאם לא כן הוא היה מעניש אותי.\nלמשל פעם לא הלך איתי לחתונה של חברים שלנו.\nלא קיבל הסברים של בטריה נגמרה או ששכחתי ברכב את הטלפון. \n',
    //         name: 'הלביאה',
    //         id: '17',
    //         tags: ['אלימות מילולית', 'קנאה'],
    //     },
    //     {
    //         timestamp: '5/17/2020 19:08:31',
    //         whatTriggeredChange:
    //             'אחרי מספר פגישות עם הקואצ\'רית ,קיבלתי אומץ להביע את רצוני להתגרש.מאז עברתי את נועה דלרוזה של הגירושים.תביעות בלי סוף ובית המשפט הפך לבית השני שלי.הפכתי בחלק מהתיקים לעו"ד של עצמי והיום לי הצלחות אבל גם כישלונות.למדתי בתחום המשפט המון.',
    //         howDidYouManged:
    //             'הגוף שלי דיבר.סבלתי מעצירויות ודימומים.ניסיתי לאמר לחברות אבל אף אחד כולל הורי לא האמינו לי.כלפי חוץ היינו זוג מושלם.בלית ברירה המשכתי לשחק כאילו הכל מושל',
    //         additionalnfo:
    //             'מלכתחילה יש לתת הרצאות התיכוניים לבנות ולספק להם כלים לא ליצור קשר עם גברים מסוכנים.אני אשמח להתנדב בפרויקט כזה',
    //         image: '',
    //         mail: '',
    //         whatHelpedYou:
    //             '\nהחוזק הנפשי שלי, התמיכה הכלכלית של המשפחה והנפשית של החברות,.כמו כן עשיתי דברים שאני אוהבת.כמו לשמוע מוזיקה,לרכב על אופנים,לטייל ברגל,לרקוד ריקודי עם.',
    //         background:
    //             'כלפי חוץ-היינו זוג מושלם:\nבית יפה\n4 ילדים חמודים ובריאים\nמטיילים המון בארץ ובחול\nכסף לא חסר.\nהיינו נשואים 30 שנה\nהכרנו לפני כן 4 שנים\nהיינו בני 22-23 כשנישאנו\nכשהתגרשנו היינו בני 52.\nבערך ב-15 שנים לאחר הנישואים\nהתחילו לעלות בראשי \nמחשבות על גירושים.\nבפועל, אזרתי אומץ רק לאחר 15 שנה נוספות\nלקום וללכת לחיים חדשים.',
    //         storyContent:
    //             'בעלי בגד בי כנראה במשך כל שנות הנישואין.\nאני ידעתי בוודאות רק בעשור האחרון\nשבו כבר היתה לו מאהבת עם ילד.\nהיא היתה גויה לא מהארץ\nוהוא היה נוסע אליה כל סוף חודש\nל-10 ימים.בשבילי היו אלה ימי החופש\nהכי כיפים.הוא לא התקשר-טען שאין לו אינטרנט,\nואני חגגתי בבילויים עם חברות ומשפחה.\nכשרציתי להתגרש, גרר אותי לטיפול זוגי.\nהיכחיש שיש לו יחסים אינטימיים וילד גם לפסיכולוגית.היה מניפולטור.תמיד האשים אותי.\nמאז שנישאנו הוא היה קנאי נוראי.תמיד האשים אותי בבגידות שלא היו ולא נבראו.לכל טלפון שלו הייתי חייבת לענות שאם לא כן הוא היה מעניש אותי.\nלמשל פעם לא הלך איתי לחתונה של חברים שלנו.\nלא קיבל הסברים של בטריה נגמרה או ששכחתי ברכב את הטלפון. \n',
    //         name: 'לביאה',
    //         id: '18',
    //         tags: ['אלימות מילולית', 'קנאה'],
    //     },
    // ],
    'GET /mock/getAllData': [
        {
            timestamp: '5/17/2020 0:10:43',
            whatTriggeredChange:
                'אחרי שנתיים שהיינו יחד הבת הבכורה שלו נפטרה. ולא משנה כמה הייתי שם, תמיד הוא עמר שאני לא נוכחת לא נמצאת, לא משקיעה , לא עושה - ראה רק שחור בי, אף פעם לא לבן. ואז הגעתי לעוד שבירה שמעוניינת לסיים את הקשר, היה שוב הסנריו הקבוע שממנו החלטתי לשים את כל הבייצים באותו סל ולהמר. עשיתי אולטימטום של לגור יחד ושאם זה יעשה לנו טוב - הרווחנו , ואם לא - אז זו תהיה פרידה סופית. אכן עברנו לגור יחד ובהתחלה זה עשה טוב ואז אחרי כמה חודשים זה נעשה רע מאוד כולל האלימות הפיזית. בשל הקושי הגדול שלו, הוא ביקש שנפצל חזרה בתים כי היה לו קושי גדול לגור עם ילדי  אבל עם דרישה שאבטיח שאנחנו נשאר ביחד. בקיצור של דבר, אני לא הייתי מסוגלת יותר, ובעצם אמרתי שאנו מפצלים בתים ונפרדים לתמיד. היה לו מאוד קשה לקבל את זה. הוא מאוד הקשה על תהליך האריזה והפיצול אבל זה קרה בסוף',
            howDidYouManged:
                'לא יכולה לומר שהתמודדתי טוב.. במהלך החמש השנים כל הזמן הייתי אומרת גם לו וגם למטפלת הזוגית שהלכנו אליה שהוא האוהב הכי גדול שלי והאויב הכי גדול שלי.  היו פעמים שהייתי מתחרפנת, היו פעמים שהייתי מכילה, היו פעמים שהייתי אובדת עצות ובעיקר חסרת אונים',
            additionalnfo:
                'זה בעיקר המודעות העצמית, כי בעיקר לא האמנתי לעצמי שאני בסיטואציה שכזו. ',
            mail: '',
            whatHelpedYou:
                'מכיוון שלא שיתפתי אף חברה ממש לאורך כל החמש שנים , הייתי צריכה להתחיל לשתף משם גם היה ברור שהן ראו המון דברים מהצד אבל פחדו לאבד אותי ולכן לא הביעו עמדה. בזכות התמיכה שלהן וההחלטה הברורה שהיה לנגד עיני שנחצה הקו האדום שלי שזה ילדי',
            background:
                'פרק ב, חמש שנים יחד כולל מגורים, התחיל לא בהבנה שלי שזה מה שקורה, בערך חודשיים מהרגע שהיינו יחד עד הסוף. הצלחתי לסיים את הקשר באוגוסט האחרון , מידי פעם עדיין צריכה להתמודד עם הודעות שלו אבל מצליחה להתמודד. בת 41',
            storyContent:
                'מערכת יחסים שונה שמעולם לא היתה לי. זה התחיל בהתמכרות להרגשת האהבה האינסופית שלו אלי. הכל היה סופר עוצמת. היתה כימיה פיזית שמעולם לא חוויתי והרצון שלו שכל הזמן נהיה יחד. כבר ממש בהתחלה היו לו כל מיני הערות וכל הזמן "זמן חינוך" של למה בפייסבוק, למה בטלפון, מי שולח הודעות והמון הערות. תמיד זה היה הופך לויכוח שאני מתייאשת בסופו ואומרת שמבינה שזה לא יכול לעבוד ושאי אפשר בכל, אנחנו שונים, חושבים, מתנהגים אחרת- זה היה מטריף אותו, הרצון שלי לפרוש וללכת- לא היה מאפשר לי ללכת, חוסם את המעבר לדלת, מחביא לי את התיק, המפתחות וכד/״... אם הייתי מספיק החלטית ומצליחה ללכת, היו 80 טלפונים,  מאבא סמסים, היה מסוגל להגיע באמצע הלילה ולדפוק בדלת שעל השכנים שומעים... בפעמים שלא היה מגיע, קרה לי לפחות פעמים שבבוקר 2 גלגלים באוטו מפונצ/״רים - ולא הייתי מבקשת את עזרתו אז היה מתעצבן שנעזרתי התיקון הפנצ/״רים בגרוש שלי. היתה תקופה שהיה אומר לי דברים שאני הבנתי מהם שהוא קורא את הוואטספים שלי, או יודע בדיוק איפה אני נמצאת )גיליתי בדיעבד שעשה שיתוף למקום שלי דרך הנייד(. היו כל כך הרבה אירועים שקשה לתאר זו כעדות כתובה... אך בשנה האחרונה האלימות הסלימה לפיזית שמצאתי את עצמי בורחת, שהוא בועט בדלת ושובר אותה כדי להגיע אלי, בסטירה שנותן לי. חשוב לציין שכל החמש שנים ניסיתי לעזוב ללא הצלחה, אני מקבילה זו למכור לסמים. אם כשעזבתי הוא היה מאפשר לי ועוזב אותי לנפשי - הייתי מצליחה,  אבל כל פעם שניסיתי לעזוב הוא היה רודף ומשכנע ואז מרעיף אהבה וכל פעם נשברתי מחדש. השיא שבעקבותיו הגעתי לחלטה שאני מצליחה לסיים את הקשר, היה ארוע אלים כאשר ילדי בבית, שהוא שבר לי צלחת ביד מעצבים בעקבות תשובה שעניתי לו. הגדול שלי נאלץ לבוא להיות לצידי כדי שהוא יתרחק. זה היה הקש האחרון שבעקבותיו התחלתי לחזק את עצמי במטרה לסיים סופית. הסיום הסופי היה 3 חודשים לאחר ארוע זה. ',
            name: 'גם אני',
            initials: 'ל',
            id: '15',
            tags: ['תמיכה ממעגלים קרובים', 'אלימות טכנולוגית', 'אלימות פיזית', 'פגיעה ברכוש', 'קנאה ואובססיביות'],
            quote: 'לא האמנתי לעצמי שאני בסיטואציה כזו'
        },
        {
            timestamp: '5/17/2020 19:08:31',
            whatTriggeredChange:
                'אחרי מספר פגישות עם הקואצ\'רית ,קיבלתי אומץ להביע את רצוני להתגרש.מאז עברתי את נועה דלרוזה של הגירושים.תביעות בלי סוף ובית המשפט הפך לבית השני שלי.הפכתי בחלק מהתיקים לעו"ד של עצמי והיום לי הצלחות אבל גם כישלונות.למדתי בתחום המשפט המון.',
            howDidYouManged:
                'הגוף שלי דיבר.סבלתי מעצירויות ודימומים.ניסיתי לאמר לחברות אבל אף אחד כולל הורי לא האמינו לי.כלפי חוץ היינו זוג מושלם.בלית ברירה המשכתי לשחק כאילו הכל מושל',
            additionalnfo:
                'מלכתחילה יש לתת הרצאות התיכוניים לבנות ולספק להם כלים לא ליצור קשר עם גברים מסוכנים.אני אשמח להתנדב בפרויקט כזה',
            image: '',
            mail: '',
            whatHelpedYou:
                '\nהחוזק הנפשי שלי, התמיכה הכלכלית של המשפחה והנפשית של החברות,.כמו כן עשיתי דברים שאני אוהבת.כמו לשמוע מוזיקה,לרכב על אופנים,לטייל ברגל,לרקוד ריקודי עם.',
            background:
                'כלפי חוץ-היינו זוג מושלם:\nבית יפה\n4 ילדים חמודים ובריאים\nמטיילים המון בארץ ובחול\nכסף לא חסר.\nהיינו נשואים 30 שנה\nהכרנו לפני כן 4 שנים\nהיינו בני 22-23 כשנישאנו\nכשהתגרשנו היינו בני 52.\nבערך ב-15 שנים לאחר הנישואים\nהתחילו לעלות בראשי \nמחשבות על גירושים.\nבפועל, אזרתי אומץ רק לאחר 15 שנה נוספות\nלקום וללכת לחיים חדשים.',
            storyContent:
                '',
            name: 'ענבר נמרא',
            initials: 'ע.נ.',
            id: '1',
            tags: ["מניפולציות וגזלייטינג", "אלימות רגשית", "ניתוק / התנתקות מחברים ומשפחה", "קנאה ואובססיביות", "בגידות", "להטב", "אלימות מילולית", "רשויות"],
            quote: 'הגסלייטינג היה שם מהרגע הראשון. כך גם ההתחזויות שלו.  הפרופיל שלו בטינדר עדיין פעיל. הוא מחפש קורבנות נוספים.'
        },
        {
            timestamp: '5/15/2020 11:23:07',
            whatTriggeredChange:
                '',
            howDidYouManged:
                '',
            additionalnfo:
                '',
            mail:
                '',
            whatHelpedYou:
                '',
            background:
                '',
            storyContent:
                '',
            name: 'דיקלה',
            initials: 'ד',
            id: '2',
            tags: ["אלימות רגשית", "אלימות פיזית", "רשויות", "טיפול פסיכולוגי"],
            quote: 'חשבתי להתגרש , כשרציתי כבר זה נהייה מסוכן ואלים.'
        },
        {
            timestamp: '5/15/2020 11:23:07',
            whatTriggeredChange:
                '',
            howDidYouManged:
                '',
            additionalnfo:
                '',
            mail:
                '',
            whatHelpedYou:
                '',
            background:
                '',
            storyContent:
                '',
            name: 'ע',
            initials: 'ע',
            id: '3',
            tags: ["איומים ואיומים בנשק", "קנאה ואובססיביות", "מניפולציות וגזלייטינג", "תקופות \"ירח דבש\"", "אלימות פיזית", "פגיעה ברכוש", "ניתוק / התנתקות מחברים ומשפחה", "הפחדה", "אלימות מינית", "אלימות רגשית", "תמיכה ממעגלים קרובים", "העצמה אישית"],
            quote: 'לא הבנתי כמה מערכת היחסים הזאת לא בריאה, כשהבנתי כבר היה מאוחר מדי.'
        },
        {
            timestamp: '5/15/2020 11:23:07',
            whatTriggeredChange:
                '',
            howDidYouManged:
                '',
            additionalnfo:
                '',
            mail:
                '',
            whatHelpedYou:
                '',
            background:
                '',
            storyContent:
                '',
            name: '',
            initials: 'ל',
            id: '4',
            tags: ["תקופות \"ירח דבש\"", "אלימות כלכלית", "אלימות מילולית", "עדויות ילדים", "ניתוק / התנתקות מחברים ומשפחה", "איומים ואיומים בנשק", "עונשים ונקמה", "משטרה", "פגיעה ברכוש", "אלימות פיזית", "רשויות", "בתי משפט וצווי הרחקה", "הפחדה", "הריון לידה והפלה", "טיפול פסיכולוגי", "עדויות ילדים"],
            quote: 'תלונות שלי במשטרה המקומית נסגרות מיידית. צווי הרחקה כנגדו, מופרים פעמים רבות, בלי שום סנקציה.'
        },
        {
            timestamp: '5/15/2020 11:23:07',
            whatTriggeredChange:
                '',
            howDidYouManged:
                '',
            additionalnfo:
                '',
            mail:
                '',
            whatHelpedYou:
                '',
            background:
                '',
            storyContent:
                '',
            name: 'בדוי',
            initials: 'ג',
            id: '5',
            tags: ["אלימות מילולית", "אלימות פיזית", "אלימות רגשית", "הפחדה", "ניתוק / התנתקות מחברים ומשפחה", "קנאה ואובססיביות", "בתי משפט וצווי הרחקה", "עדויות ילדים", "הפחדה", "מניפולציות וגזלייטינג", "תמיכה ממעגלים קרובים", "טיפול פסיכולוגי", "העצמה אישית"],
            quote: 'לא באחריותי ואין שום דבר בעולם שיכולתי לעשות כדי שיגיע לי יחס כזה ואינני לוקחת בעלות עליה.'
        },
    ],
    'GET /mock/getStoriesByTags': [
        {
            timestamp: '5/17/2020 19:00:07',
            whatTriggeredChange:
                "הוא טען שאני זו שצריכה פסיכולוג אז קיבלתי את עצתו והלכי לקואצ'רית.היא הבהירה לי שהפחד להתגרש צריך לשמור עלי לא לנהל לי את החיים.הבנתי שעלי להתגבר ולצאת לדרך.",
            howDidYouManged:
                'אני אישה מאד אופטימית אבל אם נשווה את תמונותיייה אז והיום,זה ממש לא אותה אישה.הגוף שלי דיבר במקומי.סבלתי מעצירויות ודימומים קשים.',
            additionalnfo:
                'שאחרי יום שחור תמיד תזרח השמש.לנו הנשים יש חוכמה ייצרה וחוזק נפשי.תמצאי לך את החברות הטובות שיתמכו בך ותעשי רק מה שאת אוהבת.אני היום בזוגיות שניה כבר 10 שנים ב", מאושרת בחלקי.יש לי ילדים נהדרים ונכדות מקסימות ויש בריאות טובה ואני כיום מתנדבת במכון רקמן בפרוייקט אישה לצידך הנותן אוזן קשבת לנשים בהליכי פרידה.אני עוזרת ומייעצת מניסיוני האישי ככל הניתןעצתי היא לתת הרצאות בבתי ספר לבנות מהם סימני האזהרה מפני גברים אלימים.לא לחשוב בטעות שקנאה מוגזמת היא אהבה כפי שאני חשבתי בטעות 30 שנה.',
            image: '',
            mail: 'dgntfalk98@gmail.com',
                quote:
                'אישה חזקה. מצליחה. מרוויחה טוב. יפייפיה. כל יום חוזרת הביתה והופכת לאפס',
            whatHelpedYou:
                '\nהחוזר הנפשי שלי, התמיכה הכלכלית של המשפחה והנפשית של החברות,.כמו כן עשיתי דברים שאני אוהבת.כמו לשמוע מוזיקה,לרכב על אופנים,לטייל ברגל,לרקוד ריקודי עם.',
            background:
                'כלפי חוץ-היינו זוג מושלם:\nבית יפה\n4 ילדים חמודים ובריאים\nמטיילים המון בארץ ובחול\nכסף לא חסר.\nהיינו נשואים 30 שנה\nהכרנו לפני כן 4 שנים\nהיינו בני 22-23 כשנישאנו\nכשהתגרשנו היינו בני 52.\nבערך ב-15 שנים לאחר הנישואים\nהתחילו לעלות בראשי \nמחשבות על גירושים.\nבפועל, אזרתי אומץ רק לאחר 15 שנה נוספות\nלקום וללכת לחיים חדשים.',
            storyContent:
                'בעלי בגד בי כנראה במשך כל שנות הנישואין.\nאני ידעתי בוודאות רק בעשור האחרון\nשבו כבר היתה לו מאהבת עם ילד.\nהיא היתה גויה לא מהארץ\nוהוא היה נוסע אליה כל סוף חודש\nל-10 ימים.בשבילי היו אלה ימי החופש\nהכי כיפים.הוא לא התקשר-טען שאין לו אינטרנט,\nואני חגגתי בבילויים עם חברות ומשפחה.\nכשרציתי להתגרש, גרר אותי לטיפול זוגי.\nהיכחיש שיש לו יחסים אינטימיים וילד גם לפסיכולוגית.היה מניפולטור.תמיד האשים אותי.\nמאז שנישאנו הוא היה קנאי נוראי.תמיד האשים אותי בבגידות שלא היו ולא נבראו.לכל טלפון שלו הייתי חייבת לענות שאם לא כן הוא היה מעניש אותי.\nלמשל פעם לא הלך איתי לחתונה של חברים שלנו.\nלא קיבל הסברים של בטריה נגמרה או ששכחתי ברכב את הטלפון. \n',
            name: 'הלביאה',
            id: '17',
            tags: ['אלימות מילולית', 'קנאה'],
        },
        {
            timestamp: '5/17/2020 19:08:31',
            whatTriggeredChange:
                'אחרי מספר פגישות עם הקואצ\'רית ,קיבלתי אומץ להביע את רצוני להתגרש.מאז עברתי את נועה דלרוזה של הגירושים.תביעות בלי סוף ובית המשפט הפך לבית השני שלי.הפכתי בחלק מהתיקים לעו"ד של עצמי והיום לי הצלחות אבל גם כישלונות.למדתי בתחום המשפט המון.',
            howDidYouManged:
                'הגוף שלי דיבר.סבלתי מעצירויות ודימומים.ניסיתי לאמר לחברות אבל אף אחד כולל הורי לא האמינו לי.כלפי חוץ היינו זוג מושלם.בלית ברירה המשכתי לשחק כאילו הכל מושל',
            additionalnfo:
                'מלכתחילה יש לתת הרצאות התיכוניים לבנות ולספק להם כלים לא ליצור קשר עם גברים מסוכנים.אני אשמח להתנדב בפרויקט כזה',
            image: '',
            mail: '',
                quote:
                'אישה חזקה. מצליחה. מרוויחה טוב. יפייפיה. כל יום חוזרת הביתה והופכת לאפס',
            whatHelpedYou:
                '\nהחוזק הנפשי שלי, התמיכה הכלכלית של המשפחה והנפשית של החברות,.כמו כן עשיתי דברים שאני אוהבת.כמו לשמוע מוזיקה,לרכב על אופנים,לטייל ברגל,לרקוד ריקודי עם.',
            background:
                'כלפי חוץ-היינו זוג מושלם:\nבית יפה\n4 ילדים חמודים ובריאים\nמטיילים המון בארץ ובחול\nכסף לא חסר.\nהיינו נשואים 30 שנה\nהכרנו לפני כן 4 שנים\nהיינו בני 22-23 כשנישאנו\nכשהתגרשנו היינו בני 52.\nבערך ב-15 שנים לאחר הנישואים\nהתחילו לעלות בראשי \nמחשבות על גירושים.\nבפועל, אזרתי אומץ רק לאחר 15 שנה נוספות\nלקום וללכת לחיים חדשים.',
            storyContent:
                'בעלי בגד בי כנראה במשך כל שנות הנישואין.\nאני ידעתי בוודאות רק בעשור האחרון\nשבו כבר היתה לו מאהבת עם ילד.\nהיא היתה גויה לא מהארץ\nוהוא היה נוסע אליה כל סוף חודש\nל-10 ימים.בשבילי היו אלה ימי החופש\nהכי כיפים.הוא לא התקשר-טען שאין לו אינטרנט,\nואני חגגתי בבילויים עם חברות ומשפחה.\nכשרציתי להתגרש, גרר אותי לטיפול זוגי.\nהיכחיש שיש לו יחסים אינטימיים וילד גם לפסיכולוגית.היה מניפולטור.תמיד האשים אותי.\nמאז שנישאנו הוא היה קנאי נוראי.תמיד האשים אותי בבגידות שלא היו ולא נבראו.לכל טלפון שלו הייתי חייבת לענות שאם לא כן הוא היה מעניש אותי.\nלמשל פעם לא הלך איתי לחתונה של חברים שלנו.\nלא קיבל הסברים של בטריה נגמרה או ששכחתי ברכב את הטלפון. \n',
            name: 'לביאה',
            id: '18',
            tags: ['אלימות מילולית', 'קנאה'],
        },
    ],
    'GET /mock/getAllTags': [
        'אלימות מינית',
        'אלימות כלכלית',
        'אלימות טכנולוגית',
        'אלימות פיזית',
        'אלימות מילולית',
        'איומים ואיומים בנשק',
    ],
    'GET /mock/getTagsMap': {
        1: 'אלימות מינית',
        2: 'אלימות כלכלית',
        3: 'אלימות טכנולוגית',
        4: 'אלימות פיזית',
        5: 'אלימות מילולית',
        6: 'איומים ואיומים בנשק',
        7: 'פגיעה ברכוש',
        8: 'אלימות רגשית',
        9: 'קנאה ואובססיביות',
        10: 'בגידות',
        11: 'מניפולציות וגזלייטינג',
        12: 'תקופות "ירח דבש"',
        13: 'עונשים ונקמה',
        14: 'הפחדה',
        15: 'ניתוק / התנתקות מחברים ומשפחה',
        16: 'תלות וחוסר עצמאות',
        17: 'הריון לידה והפלה',
        18: 'משטרה',
        19: 'רבנות',
        20: 'מקלט לנשים מוכות',
        21: 'רשויות',
        22: 'בתי משפט וצווי הרחקה',
        23: 'דיכאון',
        24: 'בדידות',
        25: 'פוסט טראומה',
        26: 'עדויות ילדים',
        27: 'להטב',
        28: 'טיפול פסיכולוגי',
        29: 'תמיכה ממעגלים קרובים',
        30: 'העצמה אישית'
    },
    'GET /mock/getPublicStories': [
        {
            date: '13.02.20',
            quote:
                'האלימות השקטה, אי אפשר לראות אבל היא גומרת אותך מבפנים',
            name: 'יעל יהודה',
            tags: ['אלימות פיזית', 'אלימות מילולית', 'אלימות רגשית', 'מניפולציות וגזלייטינג', 'עונשים ונקמה', 'הפחדה', 'תמיכה ממעגלים קרובים'],
        },
        {
            date: '13.02.20',
            quote:
                'מבחורה אנרגטית שהיתה בלב הקליקה החברתית, הוא הפך אותי לעכבר.',
            name: 'אינגה גל מדורסקי',
            tags: ['איומים ואיומים בנשק', 'תמיכה ממעגלים קרובים', 'הפחדה', 'עונשים ונקמה', 'הפחדה', 'אלימות מילולית', 'אלימות רגשית'],
        },
        {
            date: '13.02.20',
            quote: 'הוא איים שיחזיר אותי לאמא שלי בשקיות שחורות',
            name: 'שרית קרול',
            tags: ['אלימות רגשית', 'איומים ואיומים בנשק', 'אלימות פיזית', 'אלימות כלכלית', 'עדויות ילדים'],
        },
        {
            date: '13.02.20',
            quote:
                'אפשר לצאת מזה',
            name: 'יעל לויתן',
            tags: [],
        },
    ],
};

module.exports = proxy;
