import React from 'react';

export const Footer = () => {
    return (
        <footer>
            {/*<h1>הייתי שם#</h1>*/}
            {/*<ul>*/}
            {/*    <li className={'purple'}>עזרה וסיוע</li>*/}
            {/*    <li>מי אנחנו</li>*/}
            {/*    <li>סימני אזהרה</li>*/}
            {/*    <li>פורום מיכל סלע</li>*/}
            {/*    <li>שליחת עדות</li>*/}
            {/*    <li>נגישות</li>*/}
            {/*    <li>סטטיסטיקה</li>*/}
            {/*    <li>תמיכה טכנית</li>*/}
            {/*</ul>*/}
            {/*<ul className={'purple'}>*/}
            {/*    <div>*/}
            {/*        <h2>118</h2>*/}
            {/*        <p>קו החירום החברתי של משרד העבודה והרווחה</p>*/}
            {/*    </div>*/}
            {/*    <div>*/}
            {/*        <h2>1202/3</h2>*/}
            {/*        <p>קו החירום לנפגעות ונפגעי תקיפה מינית</p>*/}
            {/*    </div>*/}
            {/*</ul>*/}
            {/*<ul>*/}
            {/*    <h3> ׳הייתי שם׳ 2020 | מדיניות הפרטיות ©</h3>*/}
            {/*</ul>*/}
        </footer>
    );
};
