

class TagController {

    constructor() {
        this.tagsMap = {
            1: 'אלימות מינית',
            2: 'אלימות כלכלית',
            3: 'אלימות טכנולוגית',
            4: 'אלימות פיזית',
            5: 'אלימות מילולית',
            6: 'איומים ואיומים בנשק',
            7: 'פגיעה ברכוש',
            8: 'אלימות רגשית',
            9: 'קנאה ואובססיביות',
            10: 'בגידות',
            11: 'מניפולציות וגזלייטינג',
            12: 'תקופות "ירח דבש"',
            13: 'עונשים ונקמה',
            14: 'הפחדה',
            15: 'ניתוק / התנתקות מחברים ומשפחה',
            16: 'תלות וחוסר עצמאות',
            17: 'הריון לידה והפלה',
            18: 'משטרה',
            19: 'רבנות',
            20: 'מקלט לנשים מוכות',
            21: 'רשויות',
            22: 'בתי משפט וצווי הרחקה',
            23: 'דיכאון',
            24: 'בדידות',
            25: 'פוסט טראומה',
            26: 'עדויות ילדים',
            27: 'להטב',
            28: 'טיפול פסיכולוגי',
            29: 'תמיכה ממעגלים קרובים',
            30: 'העצמה אישית'
        }
    }

    getAllTags(req, res) {
        const data = Object.values(this.tagsMap);
        return res.json(data);
    }

    getTagsMap(req, res) {
        return res.json(this.tagsMap);
    }

}
module.exports = TagController;